[
  {
    "user": "Which American-born Sinclair won the Nobel Prize for Literature in 1930?",
    "response": "The American-born Sinclair who won the Nobel Prize for Literature in 1930 is Sinclair Lewis.",
    "response_spanish": "El estadounidense Sinclair que ganó el Premio Nobel de Literatura en 1930 es Sinclair Lewis."
  },
  {
    "user": "Where in England was Dame Judi Dench born?",
    "response": "Dame Judi Dench was born in York, England.",
    "response_spanish": "Dame Judi Dench nació en York, Inglaterra."
  },
  {
    "user": "In which decade did Billboard magazine first publish and American hit chart?",
    "response": "Billboard magazine first published an American hit chart in the 1930s, specifically in 1936.",
    "response_spanish": "La revista Billboard publicó por primera vez una lista de éxitos estadounidense en la década de 1930, específicamente en 1936."
  },
  {
    "user": "From which country did Angola achieve independence in 1975?",
    "response": "Angola achieved independence from Portugal in 1975.",
    "response_spanish": "Angola logró la independencia de Portugal en 1975."
  },
  {
    "user": "Which city does David Soul come from?",
    "response": "David Soul was born in Chicago, Illinois.",
    "response_spanish": "David Soul nació en Chicago, Illinois."
  },
  {
    "user": "Who won Super Bowl XX?",
    "response": "The New York Giants won Super Bowl XX.",
    "response_spanish": "Los New York Giants ganaron el Super Bowl XX."
  },
  {
    "user": "Which was the first European country to abolish capital punishment?",
    "response": "The first European country to abolish capital punishment was Portugal in 1867.",
    "response_spanish": "El primer país europeo en abolir la pena de muerte fue Portugal en 1867."
  },
  {
    "user": "In which country did he widespread use of ISDN begin in 1988?",
    "response": "The widespread use of ISDN began in 1988 in Germany.",
    "response_spanish": "El uso generalizado de ISDN comenzó en 1988 en Alemania."
  },
  {
    "user": "What is Bruce Willis' real first name?",
    "response": "Bruce Willis' real first name is Walter.",
    "response_spanish": "El verdadero primer nombre de Bruce Willis es Walter."
  },
  {
    "user": "Which William wrote the novel Lord Of The Flies?",
    "response": "The novel \"Lord of the Flies\" was written by William Golding.",
    "response_spanish": "La novela \"El señor de las moscas\" fue escrita por William Golding."
  },
  {
    "user": "Which innovation for the car was developed by Prince Henry of Prussia in 1911?",
    "response": "Prince Henry of Prussia developed the first successful automobile racing car in 1911, known as the Prince Henry Vauxhall.",
    "response_spanish": "El Príncipe Enrique de Prusia desarrolló el primer automóvil de carreras exitoso en 1911, conocido como el Prince Henry Vauxhall."
  },
  {
    "user": "How is musician William Lee Conley better known?",
    "response": "Musician William Lee Conley is better known as \"Billie Lee.\"",
    "response_spanish": "El músico William Lee Conley es mejor conocido como \"Billie Lee.\""
  },
  {
    "user": "How is Joan Molinsky better known?",
    "response": "Joan Molinsky is better known as Joan Rivers.",
    "response_spanish": "Joan Molinsky es mejor conocida como Joan Rivers."
  },
  {
    "user": "In which branch of the arts is Patricia Neary famous?",
    "response": "Patricia Neary is famous in the field of dance, particularly as a ballet dancer and choreographer.",
    "response_spanish": "Patricia Neary es famosa en el campo de la danza, particularmente como bailarina de ballet y coreógrafa."
  },
  {
    "user": "Which country is Europe's largest silk producer?",
    "response": "Italy is Europe's largest silk producer.",
    "response_spanish": "Italia es el mayor productor de seda de Europa."
  },
  {
    "user": "The VS-300 was a type of what?",
    "response": "The VS-300 was a type of helicopter, specifically one of the first successful helicopters developed by Igor Sikorsky.",
    "response_spanish": "El VS-300 era un tipo de helicóptero, específicamente uno de los primeros helicópteros exitosos desarrollados por Igor Sikorsky."
  },
  {
    "user": "At which university did Joseph Goebbels become a doctor of philosophy?",
    "response": "Joseph Goebbels became a doctor of philosophy at the University of Heidelberg.",
    "response_spanish": "Joseph Goebbels se convirtió en doctor en filosofía en la Universidad de Heidelberg."
  },
  {
    "user": "Which prince is Queen Elizabeth II's youngest son?",
    "response": "Queen Elizabeth II's youngest son is Prince Edward, Earl of Wessex.",
    "response_spanish": "El hijo menor de la Reina Isabel II es el Príncipe Eduardo, Conde de Wessex."
  },
  {
    "user": "When did the founder of Jehovah's Witnesses say the world would end?",
    "response": "Charles Taze Russell, the founder of Jehovah's Witnesses, did not specify a particular date for the end of the world, but subsequent leaders of the movement predicted various dates, notably 1914, 1925, and 1975.",
    "response_spanish": "Charles Taze Russell, el fundador de los Testigos de Jehová, no especificó una fecha particular para el fin del mundo, pero los líderes posteriores del movimiento predijeron varias fechas, notablemente 1914, 1925 y 1975."
  },
  {
    "user": "Who found the remains of the Titanic?",
    "response": "The remains of the Titanic were found by a Franco-American expedition led by Robert Ballard in 1985.",
    "response_spanish": "Los restos del Titanic fueron encontrados por una expedición franco-estadounidense liderada por Robert Ballard en 1985."
  },
  {
    "user": "Who was the only Spice Girl not to have a middle name?",
    "response": "The only Spice Girl not to have a middle name is Mel B, also known as Melanie Brown.",
    "response_spanish": "La única Spice Girl que no tiene un segundo nombre es Mel B, también conocida como Melanie Brown."
  },
  {
    "user": "What are the international registration letters of a vehicle from Algeria?",
    "response": "The international registration letters of a vehicle from Algeria are \"DZ.\"",
    "response_spanish": "Las letras de registro internacional de un vehículo de Argelia son \"DZ.\""
  },
  {
    "user": "How did Jock die in Dallas?",
    "response": "Jock Ewing died in a helicopter crash in the television series \"Dallas.\"",
    "response_spanish": "Jock Ewing murió en un accidente de helicóptero en la serie de televisión \"Dallas.\""
  },
  {
    "user": "What star sign is Michael Caine?",
    "response": "Michael Caine was born on March 14, 1933, making him a Pisces.",
    "response_spanish": "Michael Caine nació el 14 de marzo de 1933, lo que lo convierte en un Piscis."
  },
  {
    "user": "Who wrote the novel Evening Class?",
    "response": "The novel \"Evening Class\" was written by Maeve Binchy.",
    "response_spanish": "La novela \"Clase de Noche\" fue escrita por Maeve Binchy."
  },
  {
    "user": "Which country does the airline Air Pacific come from?",
    "response": "Air Pacific is from Fiji.",
    "response_spanish": "Air Pacific es de Fiji."
  },
  {
    "user": "In which branch of the arts does Allegra Kent work?",
    "response": "Allegra Kent works in the field of dance, specifically as a ballet dancer and choreographer.",
    "response_spanish": "Allegra Kent trabaja en el campo de la danza, específicamente como bailarina de ballet y coreógrafa."
  },
  {
    "user": "Who had a 70s No 1 hit with Billy, Don't Be A Hero?",
    "response": "The song \"Billy, Don't Be A Hero\" was a No. 1 hit in the 1970s for Bo Donaldson and The Heywoods.",
    "response_spanish": "La canción \"Billy, Don't Be A Hero\" fue un éxito número 1 en los años 70 para Bo Donaldson y The Heywoods."
  },
  {
    "user": "Banting and Best pioneered the use of what?",
    "response": "Banting and Best pioneered the use of insulin for the treatment of diabetes.",
    "response_spanish": "Banting y Best fueron pioneros en el uso de insulina para el tratamiento de la diabetes."
  },
  {
    "user": "Who directed the movie La Dolce Vita?",
    "response": "La Dolce Vita was directed by Federico Fellini.",
    "response_spanish": "La Dolce Vita fue dirigida por Federico Fellini."
  },
  {
    "user": "Which country does the airline LACSA come from?",
    "response": "LACSA, or Líneas Aéreas Costarricenses, is an airline from Costa Rica.",
    "response_spanish": "LACSA, o Líneas Aéreas Costarricenses, es una aerolínea de Costa Rica."
  },
  {
    "user": "Who directed 2001: A Space Odyssey?",
    "response": "2001: A Space Odyssey was directed by Stanley Kubrick.",
    "response_spanish": "2001: Una odisea del espacio fue dirigida por Stanley Kubrick."
  },
  {
    "user": "Which is the largest of the Japanese Volcano Islands?",
    "response": "The largest of the Japanese Volcano Islands is Iwo Jima.",
    "response_spanish": "La más grande de las Islas Volcánicas Japonesas es Iwo Jima."
  },
  {
    "user": "Ezzard Charles was a world champion in which sport?",
    "response": "Ezzard Charles was a world champion in boxing.",
    "response_spanish": "Ezzard Charles fue campeón del mundo en boxeo."
  },
  {
    "user": "Who was the first woman to make a solo flight across the Atlantic?",
    "response": "The first woman to make a solo flight across the Atlantic was Amelia Earhart in 1932.",
    "response_spanish": "La primera mujer en realizar un vuelo en solitario a través del Atlántico fue Amelia Earhart en 1932."
  },
  {
    "user": "Which port lies between Puget Sound and Lake Washington?",
    "response": "The port that lies between Puget Sound and Lake Washington is the Port of Seattle.",
    "response_spanish": "El puerto que se encuentra entre el Puget Sound y el Lago Washington es el Puerto de Seattle."
  },
  {
    "user": "In which city were Rotary Clubs set up in 1905?",
    "response": "Rotary Clubs were set up in Chicago in 1905.",
    "response_spanish": "Los Clubes Rotarios se establecieron en Chicago en 1905."
  },
  {
    "user": "Who became US Vice President when Spiro Agnew resigned?",
    "response": "Gerald Ford became US Vice President when Spiro Agnew resigned.",
    "response_spanish": "Gerald Ford se convirtió en Vicepresidente de EE. UU. cuando Spiro Agnew renunció."
  },
  {
    "user": "In which decade of the 20th century was Billy Crystal born?",
    "response": "Billy Crystal was born in the 1940s.",
    "response_spanish": "Billy Crystal nació en la década de 1940."
  },
  {
    "user": "Which George invented the Kodak roll-film camera?",
    "response": "George Eastman invented the Kodak roll-film camera.",
    "response_spanish": "George Eastman inventó la cámara de película en rollo Kodak."
  },
  {
    "user": "Which series had the characters Felix Unger and Oscar Madison?",
    "response": "The characters Felix Unger and Oscar Madison are from the television series \"The Odd Couple.\"",
    "response_spanish": "Los personajes Felix Unger y Oscar Madison son de la serie de televisión \"La extraña pareja.\""
  },
  {
    "user": "Who along with Philips developed the CD in the late 70s?",
    "response": "Sony developed the CD along with Philips in the late 1970s.",
    "response_spanish": "Sony desarrolló el CD junto con Philips a finales de la década de 1970."
  },
  {
    "user": "Where is the multinational Nestle based?",
    "response": "Nestlé is based in Vevey, Switzerland.",
    "response_spanish": "Nestlé tiene su sede en Vevey, Suiza."
  },
  {
    "user": "Do You Know Where You're Going To? was the theme from which film?",
    "response": "\"Do You Know Where You're Going To?\" was the theme from the film \"Mahogany.\"",
    "response_spanish": "\"¿Sabes a dónde vas?\" fue el tema de la película \"Mahogany.\""
  },
  {
    "user": "19969 was the Chinese year of which creature?",
    "response": "The year 19969 does not correspond to any year in the Chinese zodiac, as the Chinese calendar cycles every 12 years and the most recent cycle began in 1900.",
    "response_spanish": "El año 19969 no corresponde a ningún año en el zodiaco chino, ya que el calendario chino cicla cada 12 años y el ciclo más reciente comenzó en 1900."
  },
  {
    "user": "In the 90s how many points have been awarded for finishing second in a Grand Prix?",
    "response": "In the 1990s, finishing second in a Grand Prix awarded 6 points.",
    "response_spanish": "En la década de 1990, terminar segundo en un Gran Premio otorgaba 6 puntos."
  },
  {
    "user": "Stapleton international airport is in which US state?",
    "response": "Stapleton International Airport is located in Colorado.",
    "response_spanish": "El Aeropuerto Internacional Stapleton se encuentra en Colorado."
  },
  {
    "user": "What was Kevin Kline's first movie?",
    "response": "Kevin Kline's first movie was \"The Big Chill,\" released in 1983.",
    "response_spanish": "La primera película de Kevin Kline fue \"The Big Chill,\" estrenada en 1983."
  },
  {
    "user": "Which actor had a Doberman Pinscher called Kirk?",
    "response": "The actor who had a Doberman Pinscher called Kirk was Bruce Lee.",
    "response_spanish": "El actor que tenía un Doberman llamado Kirk era Bruce Lee."
  },
  {
    "user": "What day of the week was the Wall Street Crash?",
    "response": "The Wall Street Crash began on a Thursday, October 24, 1929.",
    "response_spanish": "El Crac de la Bolsa de Wall Street comenzó un jueves, 24 de octubre de 1929."
  },
  {
    "user": "The US signed a treaty with which country to allow the construction of the Panama Canal?",
    "response": "The US signed a treaty with Panama to allow the construction of the Panama Canal.",
    "response_spanish": "Estados Unidos firmó un tratado con Panamá para permitir la construcción del Canal de Panamá."
  },
  {
    "user": "What was Prince's last No 1 of the 80s?",
    "response": "Prince's last No. 1 hit of the 80s was \"Batdance,\" which topped the charts in 1989.",
    "response_spanish": "El último éxito número 1 de Prince en los 80 fue \"Batdance,\" que alcanzó la cima de las listas en 1989."
  },
  {
    "user": "Man In The Mirror first featured on which Michel Jackson album?",
    "response": "\"Man In The Mirror\" first featured on Michael Jackson's album \"Bad,\" released in 1987.",
    "response_spanish": "\"Man In The Mirror\" se presentó por primera vez en el álbum \"Bad\" de Michael Jackson, lanzado en 1987."
  },
  {
    "user": "Where was the first battle with US involvement in the Korean War?",
    "response": "The first battle with US involvement in the Korean War was the Battle of Osan, fought on July 5, 1950.",
    "response_spanish": "La primera batalla con la participación de EE. UU. en la Guerra de Corea fue la Batalla de Osan, librada el 5 de julio de 1950."
  },
  {
    "user": "On which Caribbean island did Princess Diana spend he first Christmas after her divorce was announced?",
    "response": "Princess Diana spent her first Christmas after her divorce announcement on the island of St. Tropez.",
    "response_spanish": "La princesa Diana pasó su primera Navidad después del anuncio de su divorcio en la isla de St. Tropez."
  },
  {
    "user": "In which decade was Arnold Schwarzenegger born?",
    "response": "Arnold Schwarzenegger was born in the 1940s.",
    "response_spanish": "Arnold Schwarzenegger nació en la década de 1940."
  },
  {
    "user": "Which musical featured the song Thank Heaven for Little Girls?",
    "response": "The song \"Thank Heaven for Little Girls\" is featured in the musical \"Gigi.\"",
    "response_spanish": "La canción \"Gracias al cielo por las niñitas\" se presenta en el musical \"Gigi.\""
  },
  {
    "user": "The Queen Elizabeth liner was destroyed by fire in the 70s in which harbour?",
    "response": "The Queen Elizabeth liner was destroyed by fire in Hong Kong harbour in 1972.",
    "response_spanish": "El transatlántico Queen Elizabeth fue destruido por un incendio en el puerto de Hong Kong en 1972."
  },
  {
    "user": "What breed of dog did Columbo own?",
    "response": "Columbo owned a mixed-breed dog, often referred to as a \"mutt.\"",
    "response_spanish": "Columbo tenía un perro de raza mixta, a menudo llamado \"mutt.\""
  },
  {
    "user": "What was the first movie western called?",
    "response": "The first movie western is widely considered to be \"The Great Train Robbery,\" released in 1903.",
    "response_spanish": "La primera película del oeste se considera ampliamente que es \"El gran robo del tren,\" estrenada en 1903."
  },
  {
    "user": "Which Oscar-winning actress was born on exactly the same day as actress Lindsay Wagner?",
    "response": "The Oscar-winning actress born on the same day as Lindsay Wagner is Sally Field.",
    "response_spanish": "La actriz ganadora del Oscar que nació el mismo día que Lindsay Wagner es Sally Field."
  },
  {
    "user": "Which Amendment to the Constitution brought in prohibition in 1920?",
    "response": "The 18th Amendment to the Constitution brought in prohibition in 1920.",
    "response_spanish": "La 18ª Enmienda a la Constitución instauró la prohibición en 1920."
  },
  {
    "user": "Which oil scandal hit the US in 1924?",
    "response": "The Teapot Dome scandal hit the US in 1924.",
    "response_spanish": "El escándalo de Teapot Dome afectó a EE. UU. en 1924."
  },
  {
    "user": "Phil Collins appeared in which Spielberg film with Robin Williams?",
    "response": "Phil Collins appeared in the Spielberg film \"Hook\" alongside Robin Williams.",
    "response_spanish": "Phil Collins apareció en la película de Spielberg \"Hook\" junto a Robin Williams."
  },
  {
    "user": "1998 was the Chinese year of which creature?",
    "response": "1998 was the Year of the Tiger in the Chinese zodiac.",
    "response_spanish": "1998 fue el Año del Tigre en el zodiaco chino."
  },
  {
    "user": "Which country does musician Alfred Brendel come from?",
    "response": "Alfred Brendel is from Austria.",
    "response_spanish": "Alfred Brendel es de Austria."
  },
  {
    "user": "Theodore Francis international airport is in which US state?",
    "response": "Theodore Francis Green International Airport is in Rhode Island.",
    "response_spanish": "El Aeropuerto Internacional Theodore Francis Green está en Rhode Island."
  },
  {
    "user": "In which soap did Demi Moore find fame?",
    "response": "Demi Moore found fame in the soap opera \"General Hospital.\"",
    "response_spanish": "Demi Moore encontró la fama en la telenovela \"General Hospital.\""
  },
  {
    "user": "To the nearest million, what is the population of London, England?",
    "response": "As of 2023, the population of London, England is approximately 9 million.",
    "response_spanish": "A partir de 2023, la población de Londres, Inglaterra es de aproximadamente 9 millones."
  },
  {
    "user": "What did Clarice Cliff create?",
    "response": "Clarice Cliff created vibrant and innovative art pottery, known for her distinctive designs and use of bold colors.",
    "response_spanish": "Clarice Cliff creó cerámica artística vibrante e innovadora, conocida por sus diseños distintivos y el uso de colores audaces."
  },
  {
    "user": "Which James Bond film features a song by Louis Armstrong?",
    "response": "The James Bond film \"Diamonds Are Forever\" features a song by Louis Armstrong.",
    "response_spanish": "La película de James Bond \"Los diamantes son eternos\" presenta una canción de Louis Armstrong."
  },
  {
    "user": "In what year were US ground troops first dispatched to Vietnam?",
    "response": "US ground troops were first dispatched to Vietnam in 1965.",
    "response_spanish": "Las tropas terrestres estadounidenses fueron enviadas por primera vez a Vietnam en 1965."
  },
  {
    "user": "In 1999 Anna Kournikova signed a lucrative contract to model what?",
    "response": "In 1999, Anna Kournikova signed a lucrative contract to model for the sportswear brand Nike.",
    "response_spanish": "En 1999, Anna Kournikova firmó un contrato lucrativo para modelar para la marca de ropa deportiva Nike."
  },
  {
    "user": "Which member of the Monkees came from Washington DC?",
    "response": "Davy Jones was the member of the Monkees who came from Washington, D.C.",
    "response_spanish": "Davy Jones era el miembro de los Monkees que venía de Washington, D.C."
  },
  {
    "user": "Which ship was sunk by a German submarine in 1915 with a loss of 1400 lives including 128 Americans?",
    "response": "The ship sunk by a German submarine in 1915 was the RMS Lusitania.",
    "response_spanish": "El barco hundido por un submarino alemán en 1915 fue el RMS Lusitania."
  },
  {
    "user": "In what decade were video recorders first developed?",
    "response": "Video recorders were first developed in the 1950s.",
    "response_spanish": "Los grabadores de video se desarrollaron por primera vez en la década de 1950."
  },
  {
    "user": "Who had the noels Spy Hook and Spy Line published in the 80s?",
    "response": "The novels \"Spy Hook\" and \"Spy Line\" were published by author Len Deighton in the 1980s.",
    "response_spanish": "Las novelas \"Spy Hook\" y \"Spy Line\" fueron publicadas por el autor Len Deighton en la década de 1980."
  },
  {
    "user": "the first credit cards were for use in what type of establishments?",
    "response": "The first credit cards were primarily used in specific establishments like hotels and restaurants.",
    "response_spanish": "Las primeras tarjetas de crédito se utilizaban principalmente en establecimientos específicos como hoteles y restaurantes."
  },
  {
    "user": "In which country was Ursula Andrews born?",
    "response": "Ursula Andress was born in Switzerland.",
    "response_spanish": "Ursula Andress nació en Suiza."
  },
  {
    "user": "What was CBS TV news broadcaster Walter Cronkite's stock closing phrase?",
    "response": "Walter Cronkite's stock closing phrase was \"And that's the way it is.\"",
    "response_spanish": "La frase de cierre de Walter Cronkite era \"Y así es como son las cosas.\""
  },
  {
    "user": "Who had a 70s No 1 hit with Let Your Love Flow?",
    "response": "The Bellamy Brothers had a No. 1 hit in the 70s with \"Let Your Love Flow.\"",
    "response_spanish": "Los hermanos Bellamy tuvieron un éxito número 1 en los 70 con \"Let Your Love Flow.\""
  },
  {
    "user": "Which state renewed Mike Tyson's boxing license in 1998?",
    "response": "Nevada renewed Mike Tyson's boxing license in 1998.",
    "response_spanish": "Nevada renovó la licencia de boxeo de Mike Tyson en 1998."
  },
  {
    "user": "Neil Armstrong was a pilot in which war?",
    "response": "Neil Armstrong was a pilot in the Korean War.",
    "response_spanish": "Neil Armstrong fue piloto en la Guerra de Corea."
  },
  {
    "user": "Which English-born US citizen hosted Masterpiece theater?",
    "response": "The English-born US citizen who hosted Masterpiece Theatre is Alistair Cooke.",
    "response_spanish": "El ciudadano estadounidense nacido en Inglaterra que presentó Masterpiece Theatre es Alistair Cooke."
  },
  {
    "user": "Nickelodeon was founded in 1979 by which company?",
    "response": "Nickelodeon was founded in 1979 by Warner-Amex Satellite Entertainment.",
    "response_spanish": "Nickelodeon fue fundado en 1979 por Warner-Amex Satellite Entertainment."
  },
  {
    "user": "Which element along with polonium did the Curies discover?",
    "response": "The Curies discovered radium along with polonium.",
    "response_spanish": "Los Curies descubrieron el radio junto con el polonio."
  },
  {
    "user": "In The Banana Splits what sort of animal was Snorky?",
    "response": "In The Banana Splits, Snorky was a snorkasaurus, a fictional dinosaur-like creature.",
    "response_spanish": "En Los Banana Splits, Snorky era un snorkasaurus, una criatura ficticia parecida a un dinosaurio."
  },
  {
    "user": "Who had an 80s No 1 hit with Can't Fight This Feeling?",
    "response": "REO Speedwagon had an 80s No. 1 hit with \"Can't Fight This Feeling.\"",
    "response_spanish": "REO Speedwagon tuvo un éxito número 1 en los 80 con \"Can't Fight This Feeling.\""
  },
  {
    "user": "Which parallel was the truce line in the Korean War?",
    "response": "The truce line in the Korean War was established along the 38th parallel.",
    "response_spanish": "La línea de tregua en la Guerra de Corea se estableció a lo largo del paralelo 38."
  },
  {
    "user": "On a computer keyboard which letter is between A and D?",
    "response": "The letter between A and D on a computer keyboard is C.",
    "response_spanish": "La letra entre A y D en un teclado de computadora es C."
  },
  {
    "user": "Which musical featured the song Flash Bang, Wallop?",
    "response": "The song \"Flash Bang, Wallop\" is featured in the musical \"Half a Sixpence.\"",
    "response_spanish": "La canción \"Flash Bang, Wallop\" aparece en el musical \"Half a Sixpence.\""
  },
  {
    "user": "What was Hitchcock's first sound movie?",
    "response": "Hitchcock's first sound movie was \"Blackmail,\" released in 1929.",
    "response_spanish": "La primera película sonora de Hitchcock fue \"Blackmail,\" estrenada en 1929."
  },
  {
    "user": "Which newspaper did Jackie Kennedy work for just before her marriage?",
    "response": "Jackie Kennedy worked for the Washington Times-Herald just before her marriage.",
    "response_spanish": "Jackie Kennedy trabajó para el Washington Times-Herald justo antes de su matrimonio."
  },
  {
    "user": "What are the international registration letters of a vehicle from Turkey?",
    "response": "The international registration letters for a vehicle from Turkey are \"TR\".",
    "response_spanish": "Las letras de registro internacional para un vehículo de Turquía son \"TR\"."
  },
  {
    "user": "Who wrote The Turn Of The Screw in the 19th century and The Ambassadors in the 20th?",
    "response": "Henry James wrote The Turn of the Screw in the 19th century and The Ambassadors in the 20th century.",
    "response_spanish": "Henry James escribió La vuelta de tuerca en el siglo XIX y Los embajadores en el siglo XX."
  },
  {
    "user": "Which American nuclear submarine was the first to sail across the North Pole under the ice cap?",
    "response": "The USS Nautilus was the first American nuclear submarine to sail across the North Pole under the ice cap.",
    "response_spanish": "El USS Nautilus fue el primer submarino nuclear estadounidense en navegar a través del Polo Norte bajo la capa de hielo."
  },
  {
    "user": "What was John Glenn/'s first spacecraft called?",
    "response": "John Glenn's first spacecraft was called Friendship 7.",
    "response_spanish": "La primera nave espacial de John Glenn se llamó Friendship 7."
  },
  {
    "user": "Which branch of medicine is concerned with disorders of the blood?",
    "response": "Hematology is the branch of medicine concerned with disorders of the blood.",
    "response_spanish": "La hematología es la rama de la medicina que se ocupa de los trastornos de la sangre."
  },
  {
    "user": "Where was The Iron Triangle?",
    "response": "The Iron Triangle was located in Vietnam, specifically in the region northwest of Saigon (now Ho Chi Minh City).",
    "response_spanish": "El Triángulo de Hierro estaba ubicado en Vietnam, específicamente en la región noroeste de Saigón (ahora Ciudad Ho Chi Minh)."
  },
  {
    "user": "What is the correct name of laughing gas?",
    "response": "The correct name of laughing gas is nitrous oxide.",
    "response_spanish": "El nombre correcto del gas de la risa es óxido nitroso."
  }
]