[
  {
    "user": "Which movie director was born on exactly the same day as actor Tommy Lee Jones?",
    "response": "The movie director born on the same day as actor Tommy Lee Jones is John Frankenheimer.",
    "response_spanish": "El director de cine nacido el mismo día que el actor Tommy Lee Jones es John Frankenheimer."
  },
  {
    "user": "Which singer wrote the musical Someone Like You?",
    "response": "The musical \"Someone Like You\" was written by the singer-songwriter Adele.",
    "response_spanish": "El musical \"Someone Like You\" fue escrito por la cantautora Adele."
  },
  {
    "user": "What state had its bi-centenary of joining the Union a year after North Carolina?",
    "response": "Tennessee had its bi-centenary of joining the Union a year after North Carolina.",
    "response_spanish": "Tennessee celebró su bicentenario de unirse a la Unión un año después de Carolina del Norte."
  },
  {
    "user": "With which instrument was Charlie Christian associated?",
    "response": "Charlie Christian was associated with the jazz guitar.",
    "response_spanish": "Charlie Christian estaba asociado con la guitarra de jazz."
  },
  {
    "user": "In which country is the Howrah bridge?",
    "response": "The Howrah Bridge is in India.",
    "response_spanish": "El Puente Howrah está en India."
  },
  {
    "user": "What are the international registration letters of a vehicle from Brunei?",
    "response": "The international registration letters for a vehicle from Brunei are \"B\".",
    "response_spanish": "Las letras de registro internacional para un vehículo de Brunei son \"B\"."
  },
  {
    "user": "What was Oliver Hardy's real first name?",
    "response": "Oliver Hardy's real first name was Oliver Norvell Hardy.",
    "response_spanish": "El verdadero nombre de Oliver Hardy era Oliver Norvell Hardy."
  },
  {
    "user": "Benito Juarez international airport is in which country?",
    "response": "Benito Juarez International Airport is in Mexico.",
    "response_spanish": "El Aeropuerto Internacional Benito Juárez está en México."
  },
  {
    "user": "How old would Rocky Marciano have been had he lived to the end of the 20th century?",
    "response": "Rocky Marciano would have been 77 years old at the end of the 20th century, as he was born on September 1, 1923.",
    "response_spanish": "Rocky Marciano habría cumplido 77 años al final del siglo XX, ya que nació el 1 de septiembre de 1923."
  },
  {
    "user": "Who had a 70s No 1 hit with The Night The Lights Went Out In Georgia?",
    "response": "Vicki Lawrence had a No. 1 hit in the 70s with \"The Night the Lights Went Out in Georgia.\"",
    "response_spanish": "Vicki Lawrence tuvo un éxito número 1 en los años 70 con \"La noche que se apagaron las luces en Georgia.\""
  },
  {
    "user": "Which country does the airline Gronlandsfly come from?",
    "response": "Gronlandsfly is from Greenland.",
    "response_spanish": "Gronlandsfly es de Groenlandia."
  },
  {
    "user": "Which famous actress was born on exactly the same day as gymnast Olga Korbut?",
    "response": "The famous actress born on the same day as gymnast Olga Korbut is Mia Farrow.",
    "response_spanish": "La famosa actriz nacida el mismo día que la gimnasta Olga Korbut es Mia Farrow."
  },
  {
    "user": "The diet of what mythical monster periodically included seven youths and seven maidens?",
    "response": "The diet of the mythical monster known as the Minotaur periodically included seven youths and seven maidens.",
    "response_spanish": "La dieta del monstruo mítico conocido como el Minotauro incluía periódicamente siete jóvenes y siete doncellas."
  },
  {
    "user": "In Greek mythology, who was the goddess of the rainbow?",
    "response": "In Greek mythology, the goddess of the rainbow was Iris.",
    "response_spanish": "En la mitología griega, la diosa del arcoíris era Iris."
  },
  {
    "user": "In ancient Athens, what tree was considered sacred -- with all its fruit belonging to the state, and death the penalty for anyone caught cutting one down?",
    "response": "The olive tree was considered sacred in ancient Athens, with its fruit belonging to the state and death being the penalty for cutting one down.",
    "response_spanish": "El olivo era considerado sagrado en la antigua Atenas, con su fruto perteneciendo al estado y la muerte siendo la pena por talar uno."
  },
  {
    "user": "What legendary fire-breathing female monster had a lion's head, a goat's body and a dragon's tail?",
    "response": "The legendary fire-breathing female monster is the Chimera.",
    "response_spanish": "La legendaria monstruo hembra que echa fuego es la Quimera."
  },
  {
    "user": "According to legend, who fired the arrow that hit Achilles in the heel, his only vulnerable spot?",
    "response": "According to legend, Paris fired the arrow that hit Achilles in the heel.",
    "response_spanish": "Según la leyenda, Paris disparó la flecha que hirió a Aquiles en el talón."
  },
  {
    "user": "In Greek mythology, who was the queen of the underworld and wife of Hades?",
    "response": "In Greek mythology, the queen of the underworld and wife of Hades was Persephone.",
    "response_spanish": "En la mitología griega, la reina del inframundo y esposa de Hades era Perséfone."
  },
  {
    "user": "\"Which entertainer said, \"\"He was into animal husbandry--until they caught him at it?\"",
    "response": "The entertainer who said, \"He was into animal husbandry--until they caught him at it\" is George Carlin.",
    "response_spanish": "El comediante que dijo: \"Estaba en la cría de animales--hasta que lo atraparon en ello\" es George Carlin."
  },
  {
    "user": "\"According to hippy guru Dr. Timothy Leary, what did you do before you \"\"drop out?\"\"\"",
    "response": "Before you \"drop out,\" according to Dr. Timothy Leary, you \"tune in.\"",
    "response_spanish": "Antes de que \"te desconectes\", según el Dr. Timothy Leary, \"sintonizas\"."
  },
  {
    "user": "What is Nelson Mandela's middle name?",
    "response": "Nelson Mandela's middle name is Rolihlahla.",
    "response_spanish": "El segundo nombre de Nelson Mandela es Rolihlahla."
  },
  {
    "user": "How old would James Dean have been had he lived to the end of the 20th century?",
    "response": "James Dean would have been 69 years old at the end of the 20th century.",
    "response_spanish": "James Dean habría cumplido 69 años a finales del siglo XX."
  },
  {
    "user": "Barry Clifford found fame discovering what?",
    "response": "Barry Clifford found fame discovering the wreck of the pirate ship Whydah off the coast of Cape Cod.",
    "response_spanish": "Barry Clifford encontró la fama al descubrir el naufragio del barco pirata Whydah frente a la costa de Cape Cod."
  },
  {
    "user": "What was Christopher Reeve's first movie?",
    "response": "Christopher Reeve's first movie was \"Gray Lady Down,\" released in 1978.",
    "response_spanish": "La primera película de Christopher Reeve fue \"Gray Lady Down,\" estrenada en 1978."
  },
  {
    "user": "The Porcaro Brothers featured in which group?",
    "response": "The Porcaro Brothers were featured in the rock band Toto.",
    "response_spanish": "Los Hermanos Porcaro fueron parte de la banda de rock Toto."
  },
  {
    "user": "Which city was called Leninakan until 1990?",
    "response": "The city called Leninakan until 1990 is now known as Gyumri, located in Armenia.",
    "response_spanish": "La ciudad llamada Leninakan hasta 1990 ahora se conoce como Gyumri, ubicada en Armenia."
  },
  {
    "user": "What is Iggy Pop's real name?",
    "response": "Iggy Pop's real name is James Newell Osterberg Jr.",
    "response_spanish": "El verdadero nombre de Iggy Pop es James Newell Osterberg Jr."
  },
  {
    "user": "What did Franz Kafka do for a day job?",
    "response": "Franz Kafka worked as a legal clerk and later as an insurance officer.",
    "response_spanish": "Franz Kafka trabajó como asistente legal y más tarde como oficial de seguros."
  },
  {
    "user": "Dorval International airport is in which country?",
    "response": "Dorval International Airport is in Canada.",
    "response_spanish": "El Aeropuerto Internacional de Dorval está en Canadá."
  },
  {
    "user": "In square miles how big is lake Michigan?",
    "response": "Lake Michigan covers an area of approximately 22,300 square miles.",
    "response_spanish": "El lago Michigan cubre un área de aproximadamente 22,300 millas cuadradas."
  },
  {
    "user": "Who wrote the song Momma Told Me Not To Come?",
    "response": "The song \"Momma Told Me Not to Come\" was written by Randy Newman.",
    "response_spanish": "La canción \"Momma Told Me Not to Come\" fue escrita por Randy Newman."
  },
  {
    "user": "What star sign is Harrison Ford?",
    "response": "Harrison Ford is a Scorpio, as he was born on July 13, 1942.",
    "response_spanish": "Harrison Ford es un Escorpio, ya que nació el 13 de julio de 1942."
  },
  {
    "user": "Who founded the Organization of Afro American Unity?",
    "response": "The Organization of Afro-American Unity was founded by Malcolm X in 1964.",
    "response_spanish": "La Organización de Unidad Afroamericana fue fundada por Malcolm X en 1964."
  },
  {
    "user": "Which NASA space probe was launched to Venus in 1989?",
    "response": "The NASA space probe launched to Venus in 1989 was the Magellan spacecraft.",
    "response_spanish": "La sonda espacial de la NASA lanzada a Venus en 1989 fue la nave Magallanes."
  },
  {
    "user": "Harry Weinstein became a world champion under which name?",
    "response": "Harry Weinstein became a world champion under the name \"Harry Greb.\"",
    "response_spanish": "Harry Weinstein se convirtió en campeón del mundo bajo el nombre de \"Harry Greb.\""
  },
  {
    "user": "Who directed Good Morning Vietnam?",
    "response": "Good Morning, Vietnam was directed by Barry Levinson.",
    "response_spanish": "Buenos Días, Vietnam fue dirigido por Barry Levinson."
  },
  {
    "user": "What was Bette Davis's real first name?",
    "response": "Bette Davis's real first name was Ruth.",
    "response_spanish": "El verdadero nombre de Bette Davis era Ruth."
  },
  {
    "user": "In which sport did Hollywood star Sonja Henie win Olympic Gold?",
    "response": "Sonja Henie won Olympic Gold in figure skating.",
    "response_spanish": "Sonja Henie ganó la medalla de oro olímpica en patinaje artístico."
  },
  {
    "user": "In which decade was Alzheimer's disease first clinically described?",
    "response": "Alzheimer's disease was first clinically described in the 1900s, specifically in 1906.",
    "response_spanish": "La enfermedad de Alzheimer fue descrita clínicamente por primera vez en los años 1900, específicamente en 1906."
  },
  {
    "user": "What star sign is Glenda Jackson?",
    "response": "Glenda Jackson was born on May 9, 1936, making her zodiac sign Taurus.",
    "response_spanish": "Glenda Jackson nació el 9 de mayo de 1936, lo que hace que su signo zodiacal sea Tauro."
  },
  {
    "user": "Who won Super Bowl XXV?",
    "response": "The New York Giants won Super Bowl XXV.",
    "response_spanish": "Los New York Giants ganaron el Super Bowl XXV."
  },
  {
    "user": "Robert Mueller Municipal Airport is in which US state?",
    "response": "Robert Mueller Municipal Airport is located in Texas.",
    "response_spanish": "El Aeropuerto Municipal Robert Mueller está ubicado en Texas."
  },
  {
    "user": "In what year were women first admitted to Harvard?",
    "response": "Women were first admitted to Harvard in 1977.",
    "response_spanish": "Las mujeres fueron admitidas por primera vez en Harvard en 1977."
  },
  {
    "user": "Who had 70s No 1 hit with Show and Tell?",
    "response": "Al Wilson had a 70s No. 1 hit with \"Show and Tell.\"",
    "response_spanish": "Al Wilson tuvo un éxito número 1 en los años 70 con \"Show and Tell.\""
  },
  {
    "user": "Balice international airport is in which country?",
    "response": "Balice International Airport is in Poland.",
    "response_spanish": "El Aeropuerto Internacional de Balice está en Polonia."
  },
  {
    "user": "What was the first name of the original food manufacturer Mr. Heinz?",
    "response": "The first name of the original food manufacturer Mr. Heinz was Henry.",
    "response_spanish": "El primer nombre del fabricante de alimentos original, el Sr. Heinz, era Henry."
  },
  {
    "user": "Panama proclaimed independence in 1903 from which country?",
    "response": "Panama proclaimed independence in 1903 from Colombia.",
    "response_spanish": "Panamá proclamó su independencia en 1903 de Colombia."
  },
  {
    "user": "How old was Ronald Reagan when he became US President?",
    "response": "Ronald Reagan was 69 years old when he became US President.",
    "response_spanish": "Ronald Reagan tenía 69 años cuando se convirtió en presidente de EE. UU."
  },
  {
    "user": "Which Iowa-born artist painted American Gothic and Spring Turning?",
    "response": "The Iowa-born artist who painted American Gothic and Spring Turning is Grant Wood.",
    "response_spanish": "El artista nacido en Iowa que pintó American Gothic y Spring Turning es Grant Wood."
  },
  {
    "user": "Which country does the airline Garuda come from?",
    "response": "Garuda is the national airline of Indonesia.",
    "response_spanish": "Garuda es la aerolínea nacional de Indonesia."
  },
  {
    "user": "To ten thousand square miles, what is the area of Idaho?",
    "response": "The area of Idaho is approximately 83,570 square miles.",
    "response_spanish": "El área de Idaho es aproximadamente 83,570 millas cuadradas."
  },
  {
    "user": "Sarah Vaughan first joined which band as singer?",
    "response": "Sarah Vaughan first joined the Earl Hines band as a singer.",
    "response_spanish": "Sarah Vaughan se unió por primera vez a la banda de Earl Hines como cantante."
  },
  {
    "user": "Elmas international airport is in which country?",
    "response": "Elmas International Airport is located in Italy.",
    "response_spanish": "El Aeropuerto Internacional Elmas está ubicado en Italia."
  },
  {
    "user": "Which pioneering aviator had a plane called Percival Gull?",
    "response": "The pioneering aviator who had a plane called Percival Gull was Amy Johnson.",
    "response_spanish": "La pionera aviadora que tenía un avión llamado Percival Gull fue Amy Johnson."
  },
  {
    "user": "Which British political figure became Baroness Kesteven?",
    "response": "Baroness Kesteven is the title held by the British political figure Julia Kinnock.",
    "response_spanish": "La Baronesa Kesteven es el título que ostenta la figura política británica Julia Kinnock."
  },
  {
    "user": "Henri Becquerel shared a Nobel prize for his work in discovering what?",
    "response": "Henri Becquerel shared a Nobel Prize for his work in discovering radioactivity.",
    "response_spanish": "Henri Becquerel compartió un Premio Nobel por su trabajo en el descubrimiento de la radiactividad."
  },
  {
    "user": "Who was the first white music star to record on Atlantic, through its sister label Atco?",
    "response": "The first white music star to record on Atlantic through its sister label Atco was Bobby Darin.",
    "response_spanish": "La primera estrella de música blanca en grabar en Atlantic a través de su sello hermano Atco fue Bobby Darin."
  },
  {
    "user": "Who took the assumed name Sebastian Melmoth when living in Paris?",
    "response": "Oscar Wilde took the assumed name Sebastian Melmoth when living in Paris.",
    "response_spanish": "Oscar Wilde adoptó el nombre supuesto de Sebastián Melmoth cuando vivía en París."
  },
  {
    "user": "Who signed the Pacific Security Treaty with the USA in 1951?",
    "response": "The Pacific Security Treaty, also known as the ANZUS Treaty, was signed by Australia, New Zealand, and the United States in 1951.",
    "response_spanish": "El Tratado de Seguridad del Pacífico, también conocido como el Tratado ANZUS, fue firmado por Australia, Nueva Zelanda y los Estados Unidos en 1951."
  },
  {
    "user": "How many miles long is the canal which links the Pacific and Atlantic Oceans?",
    "response": "The Panama Canal is approximately 50 miles long.",
    "response_spanish": "El Canal de Panamá tiene aproximadamente 50 millas de largo."
  },
  {
    "user": "Who founded the off-Broadway theater where Hair had its premier?",
    "response": "The off-Broadway theater where \"Hair\" premiered, the Public Theater, was founded by Joseph Papp.",
    "response_spanish": "El teatro off-Broadway donde se estrenó \"Hair\", el Public Theater, fue fundado por Joseph Papp."
  },
  {
    "user": "Established in 1919, which is the world's oldest surviving airline?",
    "response": "The world's oldest surviving airline is KLM Royal Dutch Airlines, established in 1919.",
    "response_spanish": "La aerolínea más antigua del mundo que sigue en funcionamiento es KLM Royal Dutch Airlines, establecida en 1919."
  },
  {
    "user": "\"Which US First Lady said, \"\"No one can make you feel interior unless you consent?\"\"\"",
    "response": "Eleanor Roosevelt said, \"No one can make you feel inferior unless you consent.\"",
    "response_spanish": "Eleanor Roosevelt dijo: \"Nadie puede hacerte sentir inferior a menos que consientas.\""
  },
  {
    "user": "Who won super bowl X?",
    "response": "The Pittsburgh Steelers won Super Bowl X.",
    "response_spanish": "Los Pittsburgh Steelers ganaron el Super Bowl X."
  },
  {
    "user": "Who brought to an end Jahangir Khan's long unbeaten run of success in squash in the 80s?",
    "response": "Jahangir Khan's long unbeaten run in squash was ended by the Pakistani player Qamar Zaman in 1986.",
    "response_spanish": "La larga racha invicta de Jahangir Khan en el squash fue detenida por el jugador paquistaní Qamar Zaman en 1986."
  },
  {
    "user": "Jomo Kenyatta was born into which tribe?",
    "response": "Jomo Kenyatta was born into the Kikuyu tribe.",
    "response_spanish": "Jomo Kenyatta nació en la tribu Kikuyu."
  },
  {
    "user": "Bryan Abrams, Sam Walters, Mark Calderon and Kevin Thornton formed which group?",
    "response": "They formed the group called Color Me Badd.",
    "response_spanish": "Formaron el grupo llamado Color Me Badd."
  },
  {
    "user": "When was the Scrabble World championship first held?",
    "response": "The Scrabble World Championship was first held in 1991.",
    "response_spanish": "El Campeonato Mundial de Scrabble se celebró por primera vez en 1991."
  },
  {
    "user": "Arlanda international airport is in which country?",
    "response": "Arlanda International Airport is in Sweden.",
    "response_spanish": "El Aeropuerto Internacional de Arlanda está en Suecia."
  },
  {
    "user": "What year was the centenary of Arkansas joining the Union?",
    "response": "The centenary of Arkansas joining the Union was in 1961.",
    "response_spanish": "El centenario de la entrada de Arkansas en la Unión fue en 1961."
  },
  {
    "user": "Which singer formed his own Berlee record label?",
    "response": "The singer who formed his own Berlee record label is Justin Bieber.",
    "response_spanish": "El cantante que formó su propio sello discográfico Berlee es Justin Bieber."
  },
  {
    "user": "Who duetted with Barbra Streisand on Till I Loved You in 1988?",
    "response": "John Legend duetted with Barbra Streisand on \"Till I Loved You\" in 1988.",
    "response_spanish": "John Legend hizo un dúo con Barbra Streisand en \"Till I Loved You\" en 1988."
  },
  {
    "user": "What was first published on 21st December 1913 in the New York World?",
    "response": "The first crossword puzzle was published on 21st December 1913 in the New York World.",
    "response_spanish": "El primer crucigrama fue publicado el 21 de diciembre de 1913 en el New York World."
  },
  {
    "user": "What finally knocked One Sweet Day off the No 1 position in the charts in the 90s?",
    "response": "\"Macarena (Bayside Boys Remix)\" by Los Del Rio knocked \"One Sweet Day\" off the No. 1 position in the charts in the 90s.",
    "response_spanish": "\"Macarena (Remix de Bayside Boys)\" de Los Del Rio desbancó a \"One Sweet Day\" del puesto No. 1 en las listas en los 90."
  },
  {
    "user": "In which American state are the Merril Collection and the Burke Museum of Fine Arts?",
    "response": "The Merril Collection is located in Ontario, Canada, while the Burke Museum of Natural History and Culture is in Washington State, USA.",
    "response_spanish": "La Colección Merril se encuentra en Ontario, Canadá, mientras que el Museo Burke de Historia Natural y Cultura está en el estado de Washington, EE. UU."
  },
  {
    "user": "Which actor paid $93,500 for the baseball which rolled between Bill Buckner's legs in game six of the 1986 World Series?",
    "response": "The actor who paid $93,500 for the baseball is Charlie Sheen.",
    "response_spanish": "El actor que pagó $93,500 por el béisbol es Charlie Sheen."
  },
  {
    "user": "Who was Theodore Roosevelt's Vice President between 1905 and 1909?",
    "response": "Theodore Roosevelt's Vice President between 1905 and 1909 was Charles W. Fairbanks.",
    "response_spanish": "El vicepresidente de Theodore Roosevelt entre 1905 y 1909 fue Charles W. Fairbanks."
  },
  {
    "user": "Which nation was the first to ratify the United Nations charter in 1945?",
    "response": "The United States was the first nation to ratify the United Nations Charter in 1945.",
    "response_spanish": "Los Estados Unidos fueron la primera nación en ratificar la Carta de las Naciones Unidas en 1945."
  },
  {
    "user": "What is the Alaskan terminus of the Alaskan Highway?",
    "response": "The Alaskan terminus of the Alaskan Highway is in Delta Junction, Alaska.",
    "response_spanish": "El término de la Carretera de Alaska se encuentra en Delta Junction, Alaska."
  },
  {
    "user": "What was Buster Keaton's actual first name?",
    "response": "Buster Keaton's actual first name was Joseph.",
    "response_spanish": "El verdadero nombre de Buster Keaton era Joseph."
  },
  {
    "user": "From 1903 to 1958, every Pope--bar one--took which name?",
    "response": "From 1903 to 1958, every Pope except one took the name Pius.",
    "response_spanish": "Desde 1903 hasta 1958, todos los Papas excepto uno tomaron el nombre de Pío."
  },
  {
    "user": "Which brothers were Warner Bros' first major record success?",
    "response": "The first major record success for Warner Bros. was achieved by the Everly Brothers.",
    "response_spanish": "El primer gran éxito discográfico de Warner Bros. fue logrado por los Everly Brothers."
  },
  {
    "user": "What was the title of Kitty Kelley's book about Elizabeth Taylor?",
    "response": "The title of Kitty Kelley's book about Elizabeth Taylor is \"Elizabeth Taylor: The Last Star.\"",
    "response_spanish": "El título del libro de Kitty Kelley sobre Elizabeth Taylor es \"Elizabeth Taylor: La Última Estrella.\""
  },
  {
    "user": "What are the international registration letters for a vehicle form Jordan?",
    "response": "The international registration letters for a vehicle from Jordan are \"JO.\"",
    "response_spanish": "Las letras de registro internacional para un vehículo de Jordania son \"JO.\""
  },
  {
    "user": "In which country was Julie Christie born?",
    "response": "Julie Christie was born in India.",
    "response_spanish": "Julie Christie nació en India."
  },
  {
    "user": "Which artist created the Katzenjammer Kids?",
    "response": "The Katzenjammer Kids was created by artist Rudolph Dirks.",
    "response_spanish": "Los Katzenjammer Kids fue creado por el artista Rudolph Dirks."
  },
  {
    "user": "Who had a 60s No 1 hit with Johnny Angel?",
    "response": "Shelley Fabares had a No. 1 hit with \"Johnny Angel\" in the 1960s.",
    "response_spanish": "Shelley Fabares tuvo un éxito número 1 con \"Johnny Angel\" en los años 60."
  },
  {
    "user": "Which country does the airline VIASA come from?",
    "response": "VIASA was the national airline of Venezuela.",
    "response_spanish": "VIASA fue la aerolínea nacional de Venezuela."
  },
  {
    "user": "Who directed Back To The Future?",
    "response": "Back to the Future was directed by Robert Zemeckis.",
    "response_spanish": "Regreso al Futuro fue dirigido por Robert Zemeckis."
  },
  {
    "user": "Where was Che Guevara killed?",
    "response": "Che Guevara was killed in La Higuera, Bolivia.",
    "response_spanish": "Che Guevara fue asesinado en La Higuera, Bolivia."
  },
  {
    "user": "Daryl Dragon used which name when he formed a 70s duo?",
    "response": "Daryl Dragon formed the 70s duo known as \"The Captain & Tennille.\"",
    "response_spanish": "Daryl Dragon formó el dúo de los 70 conocido como \"The Captain & Tennille.\""
  },
  {
    "user": "Which has the highest population, Rode island or South Dakota?",
    "response": "Rhode Island has a higher population than South Dakota.",
    "response_spanish": "Rhode Island tiene una población más alta que Dakota del Sur."
  },
  {
    "user": "What was Oliver Reed's real first name?",
    "response": "Oliver Reed's real first name was Robert.",
    "response_spanish": "El verdadero nombre de Oliver Reed era Robert."
  },
  {
    "user": "Which country does the airline Sansa come from?",
    "response": "Sansa is an airline from Costa Rica.",
    "response_spanish": "Sansa es una aerolínea de Costa Rica."
  },
  {
    "user": "Who wrote the song Harper Valley PTA?",
    "response": "The song \"Harper Valley PTA\" was written by Tom T. Hall.",
    "response_spanish": "La canción \"Harper Valley PTA\" fue escrita por Tom T. Hall."
  },
  {
    "user": "What was Elvis's last No 1 in his own lifetime?",
    "response": "Elvis's last No. 1 hit in his own lifetime was \"Burning Love,\" which topped the charts in 1972.",
    "response_spanish": "El último éxito número 1 de Elvis en su propia vida fue \"Burning Love,\" que encabezó las listas en 1972."
  },
  {
    "user": "Who choreographed the first performance of Copland's Rodeo?",
    "response": "The first performance of Copland's Rodeo was choreographed by Agnes de Mille.",
    "response_spanish": "La primera representación de Rodeo de Copland fue coreografiada por Agnes de Mille."
  },
  {
    "user": "Who wrote Riders of the Purple Sage?",
    "response": "Riders of the Purple Sage was written by Zane Grey.",
    "response_spanish": "Los jinetes del salvia púrpura fue escrito por Zane Grey."
  },
  {
    "user": "What were D W Griffith's first names?",
    "response": "D.W. Griffith's first names were David Wark.",
    "response_spanish": "Los primeros nombres de D.W. Griffith eran David Wark."
  },
  {
    "user": "\"Who created the line, \"\"Happiness is a warm puppy?\"",
    "response": "The line \"Happiness is a warm puppy\" was created by Charles M. Schulz, the cartoonist behind the Peanuts comic strip.",
    "response_spanish": "La frase \"La felicidad es un cachorro cálido\" fue creada por Charles M. Schulz, el caricaturista detrás de la tira cómica Peanuts."
  }
]