[
  {
    "user": "What is the distance between bases on a little league baseball field?",
    "response": "The distance between bases on a Little League baseball field is 60 feet.",
    "response_spanish": "La distancia entre las bases en un campo de béisbol de Little League es de 60 pies."
  },
  {
    "user": "How many home runs did baseball great Ty Cobb hit in the three world series in which he played?",
    "response": "Ty Cobb hit no home runs in the three World Series in which he played.",
    "response_spanish": "Ty Cobb no conectó jonrones en las tres Series Mundiales en las que jugó."
  },
  {
    "user": "In cross-country bike racing, what do the initials BMX represent?",
    "response": "BMX stands for Bicycle Motocross.",
    "response_spanish": "BMX significa Bicicleta Motocross."
  },
  {
    "user": "After retiring as a player, with what team did baseball great Babe Ruth spend one year as a coach?",
    "response": "Babe Ruth spent one year as a coach with the Boston Braves.",
    "response_spanish": "Babe Ruth pasó un año como entrenador con los Boston Braves."
  },
  {
    "user": "What is the maximum weight permitted for calves in rodeo calf-roping competition?",
    "response": "The maximum weight permitted for calves in rodeo calf-roping competitions is typically 450 pounds.",
    "response_spanish": "El peso máximo permitido para los terneros en las competiciones de lazo de terneros en rodeo es típicamente de 450 libras."
  },
  {
    "user": "What baseball player hit the only home run of his 212-year major league career off his own brother?",
    "response": "The baseball player who hit the only home run of his 212-game major league career off his own brother is Jim Abbott.",
    "response_spanish": "El jugador de béisbol que conectó el único jonrón de su carrera en las grandes ligas de 212 juegos contra su propio hermano es Jim Abbott."
  },
  {
    "user": "Brooks Robinson and Carl Yastrzemski hold the major league baseball record for playing the greatest number of seasons with the same team. How many years did they play-- and with what teams?",
    "response": "Brooks Robinson played 23 seasons with the Baltimore Orioles, and Carl Yastrzemski played 23 seasons with the Boston Red Sox.",
    "response_spanish": "Brooks Robinson jugó 23 temporadas con los Baltimore Orioles, y Carl Yastrzemski jugó 23 temporadas con los Boston Red Sox."
  },
  {
    "user": "Under the rules outlined in the charter of the International Olympic Committee, how much pure gold must there be in each gold medal awarded to first-place winners?",
    "response": "Each gold medal must contain at least 6 grams of pure gold.",
    "response_spanish": "Cada medalla de oro debe contener al menos 6 gramos de oro puro."
  },
  {
    "user": "Who was the famous great-great-grandfather of San Francisco 49er quarterback Steve Young?",
    "response": "Steve Young's famous great-great-grandfather was Brigham Young, a prominent leader in the early history of the Mormon Church.",
    "response_spanish": "El famoso tatarabuelo de Steve Young fue Brigham Young, un líder prominente en la historia temprana de la Iglesia Mormona."
  },
  {
    "user": "How many of the four Grand Slam trophies in tennis are gold; how many are silver?",
    "response": "All four Grand Slam trophies are silver, but they are often plated with gold.",
    "response_spanish": "Los cuatro trofeos de Grand Slam son de plata, pero a menudo están chapados en oro."
  },
  {
    "user": "\"What breakfast food gets its name from the German word for \"\"stirrup\"\"?\"",
    "response": "The breakfast food that gets its name from the German word for \"stirrup\" is \"stirrup cup,\" which refers to \"Schnitte,\" a type of toast.",
    "response_spanish": "La comida del desayuno que recibe su nombre de la palabra alemana para \"estribo\" es \"copa de estribo,\" que se refiere a \"Schnitte,\" un tipo de tostada."
  },
  {
    "user": "What popular drink did a Dutch medical professor produce in his laboratory while trying to come up with a blood cleanser that could be sold in drugstores?",
    "response": "The popular drink produced by a Dutch medical professor in his laboratory is known as \" tonic water,\" which led to the creation of the beverage brand Schweppes.",
    "response_spanish": "La bebida popular producida por un profesor de medicina holandés en su laboratorio es conocida como \"agua tónica,\" lo que llevó a la creación de la marca de bebidas Schweppes."
  },
  {
    "user": "On what vegetable did an ancient Egyptian place his right hand when taking an oath?",
    "response": "An ancient Egyptian placed his right hand on a leek when taking an oath.",
    "response_spanish": "Un antiguo egipcio colocó su mano derecha sobre un puerro al hacer un juramento."
  },
  {
    "user": "What American city produces most of the egg rolls sold in grocery stores in the United States?",
    "response": "Los Angeles, California, produces most of the egg rolls sold in grocery stores in the United States.",
    "response_spanish": "Los Ángeles, California, produce la mayoría de los rollos de huevo vendidos en las tiendas de comestibles en los Estados Unidos."
  },
  {
    "user": "Italy leads the world in pasta consumption with 61.7 pounds eaten per person per year. What country is second?",
    "response": "As of the latest data, the country that ranks second in pasta consumption is the United States.",
    "response_spanish": "Según los datos más recientes, el país que ocupa el segundo lugar en consumo de pasta es Estados Unidos."
  },
  {
    "user": "When Birdseye introduced the first frozen food in 1930, what did the company call it/",
    "response": "Birdseye introduced the first frozen food in 1930, calling it \"frozen peas.\"",
    "response_spanish": "Birdseye introdujo el primer alimento congelado en 1930, llamándolo \"guisantes congelados.\""
  },
  {
    "user": "Which 100-mile long waterway links the Mediterranean and the Red Sea?",
    "response": "The Suez Canal links the Mediterranean and the Red Sea.",
    "response_spanish": "El Canal de Suez conecta el Mediterráneo y el Mar Rojo."
  },
  {
    "user": "In which country is the Aswan Dam?",
    "response": "The Aswan Dam is located in Egypt.",
    "response_spanish": "La presa de Asuán está ubicada en Egipto."
  },
  {
    "user": "Where did Idi Amin rule from 1971-1979?",
    "response": "Idi Amin ruled Uganda from 1971 to 1979.",
    "response_spanish": "Idi Amin gobernó Uganda de 1971 a 1979."
  },
  {
    "user": "Which country has the rand as its currency?",
    "response": "South Africa has the rand as its currency.",
    "response_spanish": "Sudáfrica tiene el rand como su moneda."
  },
  {
    "user": "What is the former name of the People's Republic of Venin?",
    "response": "The former name of the People's Republic of Venin is the Venin Republic.",
    "response_spanish": "El antiguo nombre de la República Popular de Venin es la República de Venin."
  },
  {
    "user": "In which country are Tangier and Casablanca?",
    "response": "Tangier and Casablanca are in Morocco.",
    "response_spanish": "Tánger y Casablanca están en Marruecos."
  },
  {
    "user": "Who was the Egyptian president who was assassinated in 1981?",
    "response": "The Egyptian president who was assassinated in 1981 was Anwar Sadat.",
    "response_spanish": "El presidente egipcio que fue asesinado en 1981 fue Anwar Sadat."
  },
  {
    "user": "Which country was called Upper Volta until 1984?",
    "response": "Burkina Faso was called Upper Volta until 1984.",
    "response_spanish": "Burkina Faso se llamaba Alto Volta hasta 1984."
  },
  {
    "user": "Who was the Egyptian king whose tomb an treasures were discovered in the Valley of the Kings in 1922?",
    "response": "The Egyptian king whose tomb and treasures were discovered in the Valley of the Kings in 1922 was King Tutankhamun.",
    "response_spanish": "El rey egipcio cuya tumba y tesoros fueron descubiertos en el Valle de los Reyes en 1922 fue el rey Tutankamón."
  },
  {
    "user": "Name the East African country which lies on the equator.",
    "response": "The East African country that lies on the equator is Uganda.",
    "response_spanish": "El país de África Oriental que se encuentra en el ecuador es Uganda."
  },
  {
    "user": "What are the two main arms of the River Nile called?",
    "response": "The two main arms of the River Nile are called the White Nile and the Blue Nile.",
    "response_spanish": "Los dos principales brazos del río Nilo se llaman el Nilo Blanco y el Nilo Azul."
  },
  {
    "user": "In which country did King Hassan II ascend the throne in 1961?",
    "response": "King Hassan II ascended the throne in Morocco in 1961.",
    "response_spanish": "El rey Hassan II ascendió al trono en Marruecos en 1961."
  },
  {
    "user": "Which British general was killed at Khartoum in 1885?",
    "response": "General Charles Gordon was killed at Khartoum in 1885.",
    "response_spanish": "El general Charles Gordon fue asesinado en Jartum en 1885."
  },
  {
    "user": "On the border of which two countries is Victoria Falls?",
    "response": "Victoria Falls is located on the border of Zambia and Zimbabwe.",
    "response_spanish": "Las Cataratas Victoria se encuentran en la frontera entre Zambia y Zimbabue."
  },
  {
    "user": "What is the name of the volcanic valley that runs from the Sinai peninsula to central Mozambique?",
    "response": "The Great Rift Valley.",
    "response_spanish": "El Gran Valle del Rift."
  },
  {
    "user": "Which actor won an Academy Award for his performance in The African Queen?",
    "response": "Humphrey Bogart won an Academy Award for his performance in The African Queen.",
    "response_spanish": "Humphrey Bogart ganó un Premio de la Academia por su actuación en La reina africana."
  },
  {
    "user": "Who wrote the novel Cry, the Beloved Country about South Africa?",
    "response": "The novel \"Cry, the Beloved Country\" was written by Alan Paton.",
    "response_spanish": "La novela \"Llora, el país querido\" fue escrita por Alan Paton."
  },
  {
    "user": "What is the capital of Kenya?",
    "response": "The capital of Kenya is Nairobi.",
    "response_spanish": "La capital de Kenia es Nairobi."
  },
  {
    "user": "From which European country did Angola achieve independence in 1975?",
    "response": "Angola achieved independence from Portugal in 1975.",
    "response_spanish": "Angola logró la independencia de Portugal en 1975."
  },
  {
    "user": "Which country mainly makes up the Horn of Africa?",
    "response": "The Horn of Africa mainly comprises Somalia, Ethiopia, Eritrea, and Djibouti.",
    "response_spanish": "El Cuerno de África está compuesto principalmente por Somalia, Etiopía, Eritrea y Yibuti."
  },
  {
    "user": "What is the capital of Sierra Leone?",
    "response": "The capital of Sierra Leone is Freetown.",
    "response_spanish": "La capital de Sierra Leona es Freetown."
  },
  {
    "user": "Which country is the island of Zanzibar part of?",
    "response": "Zanzibar is part of Tanzania.",
    "response_spanish": "Zanzíbar es parte de Tanzania."
  },
  {
    "user": "What is Africa's largest country?",
    "response": "Algeria is Africa's largest country by land area.",
    "response_spanish": "Argelia es el país más grande de África por superficie terrestre."
  },
  {
    "user": "Which African country is bordered by Benin, Ghana, Ivory Coast, Niger, and Mali?",
    "response": "The African country bordered by Benin, Ghana, Ivory Coast, Niger, and Mali is Togo.",
    "response_spanish": "El país africano que limita con Benín, Ghana, Costa de Marfil, Níger y Malí es Togo."
  },
  {
    "user": "Who was the woman sentenced to six years in jail after the murder of Stompei Seipi?",
    "response": "The woman sentenced to six years in jail after the murder of Stompei Seipi was Tui K. L. W.",
    "response_spanish": "La mujer condenada a seis años de cárcel tras el asesinato de Stompei Seipi fue Tui K. L. W."
  },
  {
    "user": "In which country are the towns of Gweru and Kwekwe?",
    "response": "Gweru and Kwekwe are located in Zimbabwe.",
    "response_spanish": "Gweru y Kwekwe están ubicados en Zimbabue."
  },
  {
    "user": "Who was the founder of the Back to Africa movement who largely inspired Rastafarianism?",
    "response": "The founder of the Back to Africa movement who largely inspired Rastafarianism was Marcus Garvey.",
    "response_spanish": "El fundador del movimiento Regreso a África que inspiró en gran medida el rastafarianismo fue Marcus Garvey."
  },
  {
    "user": "Which African country is sandwiched between Ghana and Benin?",
    "response": "Togo is the African country sandwiched between Ghana and Benin.",
    "response_spanish": "Togo es el país africano que se encuentra entre Ghana y Benín."
  },
  {
    "user": "The Zambesi and which other river define the borders of Matabeleland?",
    "response": "The Zambezi River and the Limpopo River define the borders of Matabeleland.",
    "response_spanish": "El río Zambezi y el río Limpopo definen las fronteras de Matabeleland."
  },
  {
    "user": "In which mountains are Camp David?",
    "response": "Camp David is located in the Catoctin Mountain Park in the Blue Ridge Mountains of Maryland.",
    "response_spanish": "Camp David se encuentra en el Parque Montañés Catoctin en las Montañas Blue Ridge de Maryland."
  },
  {
    "user": "\"Which song say, \"\"The words of the prophet are written on the subway walls?\"\"\"",
    "response": "The song is \"The Sound of Silence\" by Simon & Garfunkel.",
    "response_spanish": "La canción es \"El sonido del silencio\" de Simon & Garfunkel."
  },
  {
    "user": "Who sang the title song for the Bond film A View To A Kill?",
    "response": "Duran Duran sang the title song for the Bond film A View To A Kill.",
    "response_spanish": "Duran Duran cantó la canción principal para la película de Bond A View To A Kill."
  },
  {
    "user": "In which country did General Jaruzelski impose marital law in 1981?",
    "response": "General Jaruzelski imposed martial law in Poland in 1981.",
    "response_spanish": "El general Jaruzelski impuso la ley marcial en Polonia en 1981."
  },
  {
    "user": "Who won the Oscar for directing It Happened One Night?",
    "response": "Frank Capra won the Oscar for directing \"It Happened One Night.\"",
    "response_spanish": "Frank Capra ganó el Oscar por dirigir \"Sucedió una Noche.\""
  },
  {
    "user": "Hellenikon international airport is in which country?",
    "response": "Hellenikon International Airport is in Greece.",
    "response_spanish": "El Aeropuerto Internacional de Hellenikon está en Grecia."
  },
  {
    "user": "Who had a 60s No 1 with Lightnin' Strikes?",
    "response": "The song \"Lightnin' Strikes\" was a No. 1 hit in the 1960s by Lou Christie.",
    "response_spanish": "La canción \"Lightnin' Strikes\" fue un éxito número 1 en la década de 1960 de Lou Christie."
  },
  {
    "user": "In which year was CNN founded?",
    "response": "CNN was founded in 1980.",
    "response_spanish": "CNN fue fundada en 1980."
  },
  {
    "user": "Who was President Reagan's Secretary for Defense from 1987 to 1989?",
    "response": "President Reagan's Secretary of Defense from 1987 to 1989 was Frank Carlucci.",
    "response_spanish": "El Secretario de Defensa del presidente Reagan de 1987 a 1989 fue Frank Carlucci."
  },
  {
    "user": "Which famous brother of Talia Shire does not share her last name?",
    "response": "The famous brother of Talia Shire who does not share her last name is Francis Ford Coppola.",
    "response_spanish": "El famoso hermano de Talia Shire que no comparte su apellido es Francis Ford Coppola."
  },
  {
    "user": "In basketball where do the Celtics come from?",
    "response": "The Boston Celtics come from Boston, Massachusetts.",
    "response_spanish": "Los Boston Celtics provienen de Boston, Massachusetts."
  },
  {
    "user": "Which Disney film had the theme tune A Whole New World?",
    "response": "The Disney film that features the theme tune \"A Whole New World\" is Aladdin.",
    "response_spanish": "La película de Disney que presenta el tema \"Un Mundo Ideal\" es Aladino."
  },
  {
    "user": "What does MG sand for in Booker T & The MG's?",
    "response": "In Booker T & The MG's, \"MG\" stands for \"Memphis Group.\"",
    "response_spanish": "En Booker T & The MG's, \"MG\" significa \"Memphis Group.\""
  },
  {
    "user": "Florence Ballard was a member of which girl group?",
    "response": "Florence Ballard was a member of The Supremes.",
    "response_spanish": "Florence Ballard fue miembro de The Supremes."
  },
  {
    "user": "Who was born first, Susan Sarandon or Glenn Close?",
    "response": "Susan Sarandon was born first on October 4, 1946, while Glenn Close was born on March 19, 1947.",
    "response_spanish": "Susan Sarandon nació primero el 4 de octubre de 1946, mientras que Glenn Close nació el 19 de marzo de 1947."
  },
  {
    "user": "Who wrote the novel The Go Between?",
    "response": "The novel The Go-Between was written by L.P. Hartley.",
    "response_spanish": "La novela El intermediario fue escrita por L.P. Hartley."
  },
  {
    "user": "In which musical do the sweeps sing Chim Chim Cheree?",
    "response": "The sweeps sing \"Chim Chim Cheree\" in the musical \"Mary Poppins.\"",
    "response_spanish": "Los barrenderos cantan \"Chim Chim Cheree\" en el musical \"Mary Poppins.\""
  },
  {
    "user": "Who had a big 60s No 1 with Tossin' and Turnin'?",
    "response": "Bobby Lewis had a big 60s No. 1 hit with \"Tossin' and Turnin'.\"",
    "response_spanish": "Bobby Lewis tuvo un gran éxito número 1 en los años 60 con \"Tossin' and Turnin'.\""
  },
  {
    "user": "Sam Phillips was owner of which legendary recording studio?",
    "response": "Sam Phillips was the owner of Sun Studio in Memphis, Tennessee.",
    "response_spanish": "Sam Phillips era el propietario de Sun Studio en Memphis, Tennessee."
  },
  {
    "user": "Which actor played Maxwell Smart?",
    "response": "Don Adams played Maxwell Smart in the original \"Get Smart\" television series.",
    "response_spanish": "Don Adams interpretó a Maxwell Smart en la serie de televisión original \"Get Smart\"."
  },
  {
    "user": "On a computer keyboard which letter on the same line is between C and B?",
    "response": "The letter between C and B on a standard QWERTY keyboard is V.",
    "response_spanish": "La letra entre C y B en un teclado QWERTY estándar es V."
  },
  {
    "user": "Lunar 10's Lunar Excursion Module was named after which famous character?",
    "response": "Lunar 10's Lunar Excursion Module was named after the famous character \"Eagle\" from the popular children's book series \"The Little Engine That Could.\"",
    "response_spanish": "El Módulo de Excursión Lunar del Lunar 10 fue nombrado en honor al famoso personaje \"Eagle\" de la popular serie de libros infantiles \"La pequeña locomotora que sí pudo.\""
  },
  {
    "user": "In which decade did golfer Gary Player last win the British Open?",
    "response": "Gary Player last won the British Open in the 1970s.",
    "response_spanish": "Gary Player ganó por última vez el Abierto Británico en la década de 1970."
  },
  {
    "user": "Sarah FitzGerald has been a 90s world champion in which sport?",
    "response": "Sarah FitzGerald was a world champion in squash during the 90s.",
    "response_spanish": "Sarah FitzGerald fue campeona del mundo en squash durante los años 90."
  },
  {
    "user": "Where was the peace treaty signed that brought World War I to an end?",
    "response": "The peace treaty that brought World War I to an end was signed in the Palace of Versailles, France.",
    "response_spanish": "El tratado de paz que puso fin a la Primera Guerra Mundial fue firmado en el Palacio de Versalles, Francia."
  },
  {
    "user": "Which Welsh singer was invited to sing at the White House on Millennium Eve?",
    "response": "The Welsh singer invited to sing at the White House on Millennium Eve was Shirley Bassey.",
    "response_spanish": "La cantante galesa invitada a cantar en la Casa Blanca en la víspera del milenio fue Shirley Bassey."
  },
  {
    "user": "Which company was responsible for the oil spill in Alaska in 1989?",
    "response": "The company responsible for the oil spill in Alaska in 1989 was Exxon, specifically the Exxon Valdez tanker spill.",
    "response_spanish": "La empresa responsable del derrame de petróleo en Alaska en 1989 fue Exxon, específicamente el derrame del petrolero Exxon Valdez."
  },
  {
    "user": "What date is Father's Day?",
    "response": "Father's Day is celebrated on the third Sunday of June in many countries, including the United States.",
    "response_spanish": "El Día del Padre se celebra el tercer domingo de junio en muchos países, incluidos los Estados Unidos."
  },
  {
    "user": "In which decade of the 20th century was the FBI set up?",
    "response": "The FBI was set up in the 1900s, specifically in 1908.",
    "response_spanish": "El FBI se estableció en el siglo XX, específicamente en 1908."
  },
  {
    "user": "In which decade of the 20th century was Dan Aykroyd born?",
    "response": "Dan Aykroyd was born in the 1950s.",
    "response_spanish": "Dan Aykroyd nació en la década de 1950."
  },
  {
    "user": "Which American wrote The Game of Chess in 1959?",
    "response": "The Game of Chess was written by American author and chess player Anthony Saidy in 1959.",
    "response_spanish": "El Juego de Ajedrez fue escrito por el autor y jugador de ajedrez estadounidense Anthony Saidy en 1959."
  },
  {
    "user": "Which leader did Hitler meet in the Brenner Pass in WWII?",
    "response": "Hitler met Italian leader Benito Mussolini in the Brenner Pass during World War II.",
    "response_spanish": "Hitler se reunió con el líder italiano Benito Mussolini en el Paso del Brennero durante la Segunda Guerra Mundial."
  },
  {
    "user": "Which company first manufactured the electric toothbrush?",
    "response": "The first electric toothbrush was manufactured by the Swiss company Broxodent in 1954.",
    "response_spanish": "El primer cepillo de dientes eléctrico fue fabricado por la empresa suiza Broxodent en 1954."
  },
  {
    "user": "Who lived under the pseudonym of Harriet Brown in New York form the 40s to the 90s?",
    "response": "The author and activist known as Harriet Brown was actually the writer and social critic, who was active in New York from the 1940s to the 1990s.",
    "response_spanish": "La autora y activista conocida como Harriet Brown fue en realidad la escritora y crítica social, que estuvo activa en Nueva York desde la década de 1940 hasta la de 1990."
  },
  {
    "user": "Which actor bought the island of Tetiaroa?",
    "response": "The actor who bought the island of Tetiaroa is Marlon Brando.",
    "response_spanish": "El actor que compró la isla de Tetiaroa es Marlon Brando."
  },
  {
    "user": "Between 1952 and 1954 did the number of TV stations in the USA double, triple or quadruple?",
    "response": "Between 1952 and 1954, the number of TV stations in the USA more than doubled.",
    "response_spanish": "Entre 1952 y 1954, el número de estaciones de televisión en EE. UU. se más que duplicó."
  },
  {
    "user": "What was Wham!'s first No 1?",
    "response": "Wham!'s first No. 1 hit was \"Wake Me Up Before You Go-Go.\"",
    "response_spanish": "El primer éxito número 1 de Wham! fue \"Wake Me Up Before You Go-Go.\""
  },
  {
    "user": "Which musical featured the song You'll Never Walk Alone?",
    "response": "The song \"You'll Never Walk Alone\" is featured in the musical \"Carousel.\"",
    "response_spanish": "La canción \"You'll Never Walk Alone\" se presenta en el musical \"Carousel.\""
  },
  {
    "user": "In which year was Bloody Sunday in Londonderry?",
    "response": "Bloody Sunday in Londonderry occurred in 1972.",
    "response_spanish": "El Domingo Sangriento en Londonderry ocurrió en 1972."
  },
  {
    "user": "The first untethered space walk took place from which space craft?",
    "response": "The first untethered space walk took place from the Space Shuttle Challenger during the STS-41-B mission.",
    "response_spanish": "La primera caminata espacial sin ataduras tuvo lugar desde el transbordador espacial Challenger durante la misión STS-41-B."
  },
  {
    "user": "What was the main color of a Storm trooper in Star Wars?",
    "response": "The main color of a Stormtrooper in Star Wars is white.",
    "response_spanish": "El color principal de un Stormtrooper en Star Wars es blanco."
  },
  {
    "user": "Richard Nixon was Vice President to which US state?",
    "response": "Richard Nixon was Vice President under President Dwight D. Eisenhower, representing the United States as a whole, not a specific state.",
    "response_spanish": "Richard Nixon fue Vicepresidente bajo el Presidente Dwight D. Eisenhower, representando a los Estados Unidos en su conjunto, no a un estado específico."
  },
  {
    "user": "Luxor international airport is in which country?",
    "response": "Luxor International Airport is in Egypt.",
    "response_spanish": "El Aeropuerto Internacional de Luxor está en Egipto."
  },
  {
    "user": "Which country did Albert Einstein move to as the Nazis rose to power?",
    "response": "Albert Einstein moved to the United States as the Nazis rose to power.",
    "response_spanish": "Albert Einstein se mudó a los Estados Unidos a medida que los nazis ascendían al poder."
  },
  {
    "user": "In the 90s how many points have been awarded for finishing first in a Grand Prix?",
    "response": "In the 1990s, finishing first in a Grand Prix awarded 10 points.",
    "response_spanish": "En la década de 1990, terminar primero en un Gran Premio otorgaba 10 puntos."
  },
  {
    "user": "Which lawyer made Raymond Burr famous?",
    "response": "The lawyer who made Raymond Burr famous was Perry Mason, a character he portrayed on television.",
    "response_spanish": "El abogado que hizo famoso a Raymond Burr fue Perry Mason, un personaje que interpretó en la televisión."
  },
  {
    "user": "Which broadcasting company did Edward J Noble found?",
    "response": "Edward J. Noble founded the American Broadcasting Company (ABC).",
    "response_spanish": "Edward J. Noble fundó la American Broadcasting Company (ABC)."
  },
  {
    "user": "In which decade did the Jackson 5 sign to Motown?",
    "response": "The Jackson 5 signed to Motown in the 1960s.",
    "response_spanish": "Los Jackson 5 firmaron con Motown en la década de 1960."
  },
  {
    "user": "How many vice presidents did Franklin D Roosevelt have?",
    "response": "Franklin D. Roosevelt had three vice presidents during his presidency: John Nance Garner, Henry A. Wallace, and Harry S. Truman.",
    "response_spanish": "Franklin D. Roosevelt tuvo tres vicepresidentes durante su presidencia: John Nance Garner, Henry A. Wallace y Harry S. Truman."
  },
  {
    "user": "In which state is Harrah's Auto Collection situated?",
    "response": "Harrah's Auto Collection is situated in Nevada.",
    "response_spanish": "La Colección de Autos de Harrah se encuentra en Nevada."
  },
  {
    "user": "What was the name of Gene Autry's horse?",
    "response": "Gene Autry's horse was named Champion.",
    "response_spanish": "El caballo de Gene Autry se llamaba Champion."
  },
  {
    "user": "Which city has a sports team of Steelers and team of Pirates?",
    "response": "Pittsburgh has sports teams named the Steelers and the Pirates.",
    "response_spanish": "Pittsburgh tiene equipos deportivos llamados los Steelers y los Pirates."
  },
  {
    "user": "What did Fort Dearborn, Indian Territory change its name to?",
    "response": "Fort Dearborn, Indian Territory changed its name to Chicago.",
    "response_spanish": "Fort Dearborn, Territorio Indígena cambió su nombre a Chicago."
  },
  {
    "user": "Bill Berry retired through ill health as a drummer in which band?",
    "response": "Bill Berry retired through ill health as a drummer in the band R.E.M.",
    "response_spanish": "Bill Berry se retiró por problemas de salud como baterista de la banda R.E.M."
  },
  {
    "user": "Leslie Nielsen trained in which of the armed services in WWII?",
    "response": "Leslie Nielsen trained in the Royal Canadian Air Force during World War II.",
    "response_spanish": "Leslie Nielsen se entrenó en la Real Fuerza Aérea Canadiense durante la Segunda Guerra Mundial."
  }
]