[
  {
    "user": "What went with Blood and Sweat in the name of the 60s rock band?",
    "response": "The name of the 60s rock band is \"Blood, Sweat & Tears.\"",
    "response_spanish": "El nombre de la banda de rock de los 60 es \"Blood, Sweat & Tears.\""
  },
  {
    "user": "Which musical featured the song I Feel Pretty?",
    "response": "The song \"I Feel Pretty\" is featured in the musical \"West Side Story.\"",
    "response_spanish": "La canción \"I Feel Pretty\" se presenta en el musical \"West Side Story.\""
  },
  {
    "user": "Who produced the first Jetliner in 1957?",
    "response": "The first jetliner, the de Havilland Comet, was produced by the British manufacturer de Havilland in 1957.",
    "response_spanish": "El primer avión de pasajeros a reacción, el de Havilland Comet, fue producido por el fabricante británico de Havilland en 1957."
  },
  {
    "user": "In which decade of the 20th century was James Caan born?",
    "response": "James Caan was born in the 1940s.",
    "response_spanish": "James Caan nació en la década de 1940."
  },
  {
    "user": "In which country is the deepwater port of Trondheim?",
    "response": "The deepwater port of Trondheim is located in Norway.",
    "response_spanish": "El puerto en aguas profundas de Trondheim está ubicado en Noruega."
  },
  {
    "user": "In which state is Camp David?",
    "response": "Camp David is located in Maryland.",
    "response_spanish": "Camp David está ubicado en Maryland."
  },
  {
    "user": "What was the Statue of Liberty originally called?",
    "response": "The Statue of Liberty was originally called \"Liberty Enlightening the World.\"",
    "response_spanish": "La Estatua de la Libertad se llamaba originalmente \"Libertad iluminando el mundo.\""
  },
  {
    "user": "Who sang the Bond theme form From Russia With Love?",
    "response": "The Bond theme from \"From Russia With Love\" was sung by Matt Monro.",
    "response_spanish": "El tema de Bond de \"Desde Rusia con amor\" fue cantado por Matt Monro."
  },
  {
    "user": "Which company was responsible for the oil spill in New York harbor in 1990?",
    "response": "The company responsible for the oil spill in New York harbor in 1990 was Mobil Oil Corporation.",
    "response_spanish": "La empresa responsable del derrame de petróleo en el puerto de Nueva York en 1990 fue Mobil Oil Corporation."
  },
  {
    "user": "In which country was Arnold Schwarzenegger born?",
    "response": "Arnold Schwarzenegger was born in Austria.",
    "response_spanish": "Arnold Schwarzenegger nació en Austria."
  },
  {
    "user": "Who had an 80s No 1 with Don't You Want Me?",
    "response": "The Human League had an 80s No 1 hit with \"Don't You Want Me.\"",
    "response_spanish": "The Human League tuvo un éxito número 1 en los 80 con \"Don't You Want Me.\""
  },
  {
    "user": "Which star of Hannah And Her Sisters has a child called Free?",
    "response": "The star of \"Hannah and Her Sisters\" who has a child named Free is Demi Moore.",
    "response_spanish": "La estrella de \"Hannah y sus hermanas\" que tiene un hijo llamado Free es Demi Moore."
  },
  {
    "user": "Who had 70s hits with Have You Seen Her and Oh Girl?",
    "response": "The Chi-Lites had 70s hits with \"Have You Seen Her\" and \"Oh Girl.\"",
    "response_spanish": "Los Chi-Lites tuvieron éxitos en los años 70 con \"Have You Seen Her\" y \"Oh Girl.\""
  },
  {
    "user": "In which decade of the 20th century was Father's Day first celebrated?",
    "response": "Father's Day was first celebrated in the 1910s, specifically in 1910.",
    "response_spanish": "El Día del Padre se celebró por primera vez en la década de 1910, específicamente en 1910."
  },
  {
    "user": "\"What was the name of the \"\"girl with kaleidoscope eyes\"\" in a Beatles song?\"",
    "response": "The name of the \"girl with kaleidoscope eyes\" in a Beatles song is Lucy.",
    "response_spanish": "El nombre de la \"chica con ojos de caleidoscopio\" en una canción de los Beatles es Lucy."
  },
  {
    "user": "Will Rogers airport was built in which US state?",
    "response": "Will Rogers Airport is located in Oklahoma.",
    "response_spanish": "El Aeropuerto Will Rogers está ubicado en Oklahoma."
  },
  {
    "user": "What writer was expelled from West Point for showing up for a public parade wearing only a white belt and gloves?",
    "response": "The writer expelled from West Point for that incident was Edgar Allan Poe.",
    "response_spanish": "El escritor expulsado de West Point por ese incidente fue Edgar Allan Poe."
  },
  {
    "user": "\"What couple live next door to Dagwood and Blondie Bumstead in \"\"Blondie\"\"?\"",
    "response": "The couple that live next door to Dagwood and Blondie Bumstead in \"Blondie\" are Herb and Tootsie Woodley.",
    "response_spanish": "La pareja que vive al lado de Dagwood y Blondie Bumstead en \"Blondie\" son Herb y Tootsie Woodley."
  },
  {
    "user": "Who was the Lone Ranger's great grand-nephew?",
    "response": "The Lone Ranger's great grand-nephew was a character named Dan Reid.",
    "response_spanish": "El bisnieto del Llanero Solitario era un personaje llamado Dan Reid."
  },
  {
    "user": "\"Psychologist William Moulton Marston, inventor of the polygraph, or lie detector, also created a famous comic book heroine,. Who was she?\"\"\"",
    "response": "She was Wonder Woman.",
    "response_spanish": "Ella era la Mujer Maravilla."
  },
  {
    "user": "\"\"\"Last night I dreamt I went to Manderley again,\"\" was the first line of what Daphne du Maurier novel?\"",
    "response": "The first line is from the novel \"Rebecca.\"",
    "response_spanish": "La primera línea es de la novela \"Rebecca.\""
  },
  {
    "user": "\"What is the actual title of Leonardo da Vinci's \"\"Mona Lisa\"\"?\"",
    "response": "The actual title of Leonardo da Vinci's \"Mona Lisa\" is \"La Gioconda.\"",
    "response_spanish": "El título real de la \"Mona Lisa\" de Leonardo da Vinci es \"La Gioconda.\""
  },
  {
    "user": "In Henry Wadsworth Longfellow's famous poem, Hiawatha, what was the name of Hiawatha's wife?",
    "response": "Hiawatha's wife's name was Minnehaha.",
    "response_spanish": "El nombre de la esposa de Hiawatha era Minnehaha."
  },
  {
    "user": "How many husbands did the Wife of Bath have, as reported in Chaucer's Canterbury Tales?",
    "response": "The Wife of Bath had five husbands, as reported in Chaucer's Canterbury Tales.",
    "response_spanish": "La esposa de Bath tuvo cinco maridos, como se informa en los Cuentos de Canterbury de Chaucer."
  },
  {
    "user": "What was the name of the she-ape that rescued the infant Tarzan and raised him to be Lord of the Apes?",
    "response": "The she-ape that rescued Tarzan and raised him was named Kala.",
    "response_spanish": "La hembra de simio que rescató a Tarzán y lo crió se llamaba Kala."
  },
  {
    "user": "What was the title of Mac West's 1959 autobiography?",
    "response": "The title of Mac West's 1959 autobiography is \"Goodness Had Nothing to Do with It.\"",
    "response_spanish": "El título de la autobiografía de Mac West de 1959 es \"La bondad no tuvo nada que ver con eso.\""
  },
  {
    "user": "\"What words did Lewis Carroll combine to come up with the term \"\"chortle\"\" in Through a Looking-Glass?\"",
    "response": "Lewis Carroll combined the words \"chuckle\" and \"snort\" to create the term \"chortle\" in \"Through a Looking-Glass.\"",
    "response_spanish": "Lewis Carroll combinó las palabras \"chuckle\" y \"snort\" para crear el término \"chortle\" en \"A través del espejo.\""
  },
  {
    "user": "\"Shakespeare wrote that \"\"brevity is the soul of wit.\"\" What did noted wit Dorothy Parker say it was?\"",
    "response": "Dorothy Parker famously quipped that \"brevity is the soul of lingerie.\"",
    "response_spanish": "Dorothy Parker dijo famosamente que \"la brevedad es el alma de la lencería.\""
  },
  {
    "user": "What is the native country of Agatha Chrisitie's detective Hercule Poirot?",
    "response": "Hercule Poirot is from Belgium.",
    "response_spanish": "Hercule Poirot es de Bélgica."
  },
  {
    "user": "What was the hometown of Sgt. Snorkel in Beetle Bailey?",
    "response": "Sgt. Snorkel's hometown in Beetle Bailey is Camp Swampy.",
    "response_spanish": "La ciudad natal del Sargento Snorkel en Beetle Bailey es Campamento Pantano."
  },
  {
    "user": "In the Robin Hood stories, what was the real name of Little John?",
    "response": "In the Robin Hood stories, Little John's real name is John Little.",
    "response_spanish": "En las historias de Robin Hood, el verdadero nombre de Little John es John Little."
  },
  {
    "user": "The Last Of The Really Great Whangdoodles and Mandy are children's books written by what well-known Oscar-winning actress?",
    "response": "The Last Of The Really Great Whangdoodles and Mandy are children's books written by Julie Andrews.",
    "response_spanish": "El Último De Los Verdaderos Gran Whangdoodles y Mandy son libros infantiles escritos por Julie Andrews."
  },
  {
    "user": "By what pseudonym is writer Frederick Dannay Manfred Bennington Lee better known?",
    "response": "Frederick Dannay Manfred Bennington Lee is better known by the pseudonym \"Ellery Queen.\"",
    "response_spanish": "Frederick Dannay Manfred Bennington Lee es mejor conocido por el seudónimo \"Ellery Queen.\""
  },
  {
    "user": "How many times did Ernest Hemingway revise the last page of A Farewell To Arms?",
    "response": "Ernest Hemingway revised the last page of A Farewell to Arms multiple times, with reports indicating he made up to 47 revisions.",
    "response_spanish": "Ernest Hemingway revisó la última página de Adiós a las armas múltiples veces, con informes que indican que hizo hasta 47 revisiones."
  },
  {
    "user": "What was art-world guru Andy Warhol's name at birth?",
    "response": "Andy Warhol was born as Andrew Warhola.",
    "response_spanish": "Andy Warhol nació como Andrew Warhola."
  },
  {
    "user": "What was the maiden name of Blondie Bumstead, the comic-strip wife of hapless Dagwood Bumstead?",
    "response": "Blondie Bumstead's maiden name is Blondie Boopadoop.",
    "response_spanish": "El apellido de soltera de Blondie Bumstead es Blondie Boopadoop."
  },
  {
    "user": "What famous comic strip character was inspired by the 1936 Henry Fonda film Trail of the Lonesome Pine?",
    "response": "The famous comic strip character inspired by the 1936 film \"Trail of the Lonesome Pine\" is Lil Abner.",
    "response_spanish": "El famoso personaje de tira cómica inspirado en la película de 1936 \"Trail of the Lonesome Pine\" es Lil Abner."
  },
  {
    "user": "What was the original name of the orphan created in 1924 by cartoonist Harold Gray in the comic strip we know as Little Orphan Annie?",
    "response": "The original name of the orphan was \"Little Orphan Otto.\"",
    "response_spanish": "El nombre original del huérfano era \"Pequeño Huérfano Otto.\""
  },
  {
    "user": "What was the name of Elizabeth Barrett Browning's pet golden cocker spaniel ?",
    "response": "Elizabeth Barrett Browning's pet golden cocker spaniel was named Flush.",
    "response_spanish": "El perro de compañía cocker spaniel dorado de Elizabeth Barrett Browning se llamaba Flush."
  },
  {
    "user": "The title of what poetic drama by Robert Browning was used to name a Kentucky town?",
    "response": "The title of the poetic drama by Robert Browning that was used to name a Kentucky town is \"Pippa Passes.\"",
    "response_spanish": "El título del drama poético de Robert Browning que se utilizó para nombrar a un pueblo de Kentucky es \"Pippa Pasa.\""
  },
  {
    "user": "What did L. Fran Baum, author of the The Wonderful Wizard of Oz, call his home in Hollywood?",
    "response": "L. Frank Baum called his home in Hollywood \"Ozcot.\"",
    "response_spanish": "L. Frank Baum llamó a su hogar en Hollywood \"Ozcot.\""
  },
  {
    "user": "What exotic city was featured in National Geographic magazine's first photo story in 1905?",
    "response": "The exotic city featured in National Geographic magazine's first photo story in 1905 was Kathmandu.",
    "response_spanish": "La ciudad exótica presentada en la primera historia fotográfica de la revista National Geographic en 1905 fue Katmandú."
  },
  {
    "user": "How much time did Jonah spend in the belly of the whale?",
    "response": "Jonah spent three days and three nights in the belly of the whale.",
    "response_spanish": "Jonás pasó tres días y tres noches en el vientre de la ballena."
  },
  {
    "user": "For what event in February 1964 did evangelist Billy Graham break his strict rule against watching TV on Sunday?",
    "response": "Billy Graham broke his rule against watching TV on Sunday to watch the Beatles' appearance on \"The Ed Sullivan Show\" in February 1964.",
    "response_spanish": "Billy Graham rompió su regla de no ver televisión los domingos para ver la aparición de los Beatles en \"The Ed Sullivan Show\" en febrero de 1964."
  },
  {
    "user": "How tall was Goliath, the Philistine giant slain by David with a stone hurled from a sling?",
    "response": "Goliath was described as being \"six cubits and a span\" tall, which is approximately 9 feet 9 inches (about 2.97 meters).",
    "response_spanish": "Goliat fue descrito como \"seis codos y un palmo\" de altura, lo que equivale a aproximadamente 9 pies 9 pulgadas (alrededor de 2.97 metros)."
  },
  {
    "user": "\"In the Bible, for what \"\"price\"\" did Esau sell his birthright to his younger twin brother, Jacob?\"",
    "response": "Esau sold his birthright to Jacob for a bowl of lentil stew.",
    "response_spanish": "Esaú vendió su primogenitura a Jacob por un plato de estofado de lentejas."
  },
  {
    "user": "What bird is named for the apostle Peter?",
    "response": "The bird named for the apostle Peter is the \"Puffin,\" specifically the Atlantic Puffin, which is sometimes referred to as \"Peter's bird.\"",
    "response_spanish": "El pájaro nombrado en honor al apóstol Pedro es el \"Frailecillo,\" específicamente el Frailecillo Atlántico, que a veces se denomina \"el pájaro de Pedro.\""
  },
  {
    "user": "Who is the only woman whose age is mentioned in the Bible?",
    "response": "The only woman whose age is mentioned in the Bible is Sarah, who was 90 years old when she gave birth to Isaac.",
    "response_spanish": "La única mujer cuyo edad se menciona en la Biblia es Sara, quien tenía 90 años cuando dio a luz a Isaac."
  },
  {
    "user": "What is the most common name in the Bible--shared by 32 people in the Old Testament and one in the New Testament?",
    "response": "The most common name in the Bible is \"Zebulun.\"",
    "response_spanish": "El nombre más común en la Biblia es \"Zebulún.\""
  },
  {
    "user": "In what language was the New Testament originally written?",
    "response": "The New Testament was originally written in Greek.",
    "response_spanish": "El Nuevo Testamento fue escrito originalmente en griego."
  },
  {
    "user": "What was the total population of the world at the time of Christ?",
    "response": "The total population of the world at the time of Christ is estimated to have been around 300 million.",
    "response_spanish": "Se estima que la población total del mundo en la época de Cristo era de alrededor de 300 millones."
  },
  {
    "user": "Who were the parents of King Solomon?",
    "response": "King Solomon's parents were King David and Bathsheba.",
    "response_spanish": "Los padres del Rey Salomón fueron el Rey David y Betsabé."
  },
  {
    "user": "What is the name of Dr. Seuss's egg-hatching elephant?",
    "response": "The name of Dr. Seuss's egg-hatching elephant is Horton.",
    "response_spanish": "El nombre del elefante que pone huevos de Dr. Seuss es Horton."
  },
  {
    "user": "Who was Clark Kent's high school sweetheart?",
    "response": "Clark Kent's high school sweetheart was Lana Lang.",
    "response_spanish": "La novia de la escuela secundaria de Clark Kent era Lana Lang."
  },
  {
    "user": "\"What famous book begins: \"\"Chug, chug, chug. Puff, puff, puff\"\"?\"",
    "response": "The famous book that begins with \"Chug, chug, chug. Puff, puff, puff\" is \"The Little Engine That Could\" by Watty Piper.",
    "response_spanish": "El famoso libro que comienza con \"Chug, chug, chug. Puff, puff, puff\" es \"La pequeña locomotora que sí pudo\" de Watty Piper."
  },
  {
    "user": "To whom did Herman Melville dedicate his novel, Moby Dick?",
    "response": "Herman Melville dedicated Moby Dick to Nathaniel Hawthorne.",
    "response_spanish": "Herman Melville dedicó Moby Dick a Nathaniel Hawthorne."
  },
  {
    "user": "\"Under what assumed name did Oscar Wilde live out the last three years of his life, in \"\"France?\"",
    "response": "Oscar Wilde lived under the assumed name \"Sebastian Melmoth\" during the last three years of his life in France.",
    "response_spanish": "Oscar Wilde vivió bajo el nombre supuesto de \"Sebastian Melmoth\" durante los últimos tres años de su vida en Francia."
  },
  {
    "user": "What was Scarlett O'Hara's real first name?",
    "response": "Scarlett O'Hara's real first name is Katie.",
    "response_spanish": "El verdadero primer nombre de Scarlett O'Hara es Katie."
  },
  {
    "user": "How many years did Robinson Crusoe spend shipwrecked on his island?",
    "response": "Robinson Crusoe spent 28 years shipwrecked on his island.",
    "response_spanish": "Robinson Crusoe pasó 28 años naufragado en su isla."
  },
  {
    "user": "\"What one word was intentionally left out of the movie version of Mario Puzo's novel, \"\"The Godfather\"\". even though this word was the working title of the book?\"",
    "response": "The one word intentionally left out of the movie version of \"The Godfather\" is \"Omertà.\"",
    "response_spanish": "La única palabra que se dejó intencionadamente fuera de la versión cinematográfica de \"El Padrino\" es \"Omertà.\""
  },
  {
    "user": "In the comic strips, what was the name of Mandrake the Magician's giant partner?",
    "response": "Mandrake the Magician's giant partner is named Lothar.",
    "response_spanish": "El gigante compañero de Mandrake el Mago se llama Lothar."
  },
  {
    "user": "What was the name of the pig leader in George Orwell's Animal Farm?",
    "response": "The name of the pig leader in George Orwell's Animal Farm is Napoleon.",
    "response_spanish": "El nombre del líder de los cerdos en \"Rebelión en la granja\" de George Orwell es Napoleón."
  },
  {
    "user": "Tess Trueheart is the wife of what comic strip character?",
    "response": "Tess Trueheart is the wife of the comic strip character Dick Tracy.",
    "response_spanish": "Tess Trueheart es la esposa del personaje de la tira cómica Dick Tracy."
  },
  {
    "user": "In the Little Orphan Annie comic strip, what was the name of Daddy Warbucks's Giant bodyguard who wore a turban?",
    "response": "The name of Daddy Warbucks's giant bodyguard who wore a turban was Punjab.",
    "response_spanish": "El nombre del gigantesco guardaespaldas de Daddy Warbucks que llevaba un turbante era Punjab."
  },
  {
    "user": "The Terror of the Monster was an early title for a best-selling novel which inspired one of the highest-grossing movies of the mid-70's. Under what name did it eventually terrify the reading and film going public?",
    "response": "It eventually became known as \"Jaws.\"",
    "response_spanish": "Eventualmente se conoció como \"Jaws.\""
  },
  {
    "user": "Who wrote the story upon which Alfred Hitchcock based his 1963 suspense film The Birds?",
    "response": "The story upon which Alfred Hitchcock based his 1963 film The Birds was written by Daphne du Maurier.",
    "response_spanish": "La historia en la que Alfred Hitchcock basó su película de 1963 Los pájaros fue escrita por Daphne du Maurier."
  },
  {
    "user": "Who was British Prime Minister when World War II broke out?",
    "response": "Neville Chamberlain was the British Prime Minister when World War II broke out in 1939.",
    "response_spanish": "Neville Chamberlain era el Primer Ministro británico cuando estalló la Segunda Guerra Mundial en 1939."
  },
  {
    "user": "How was Oflag IVC prison camp better known?",
    "response": "Oflag IVC was better known as Colditz Castle.",
    "response_spanish": "Oflag IVC era más conocido como el Castillo de Colditz."
  },
  {
    "user": "Who succeeded Theodore Roosevelt as President?",
    "response": "William Howard Taft succeeded Theodore Roosevelt as President.",
    "response_spanish": "William Howard Taft sucedió a Theodore Roosevelt como Presidente."
  },
  {
    "user": "To whom did the Bee Gees pay tribute in Tapestry Revisited?",
    "response": "The Bee Gees paid tribute to Carole King in Tapestry Revisited.",
    "response_spanish": "Los Bee Gees rindieron homenaje a Carole King en Tapestry Revisited."
  },
  {
    "user": "Who was born first, James Caan or Michael Douglas?",
    "response": "James Caan was born first on March 26, 1940, while Michael Douglas was born later on September 25, 1944.",
    "response_spanish": "James Caan nació primero el 26 de marzo de 1940, mientras que Michael Douglas nació más tarde el 25 de septiembre de 1944."
  },
  {
    "user": "In which country is the deepwater ort of Brindisi?",
    "response": "The deepwater port of Brindisi is located in Italy.",
    "response_spanish": "El puerto de aguas profundas de Brindisi está ubicado en Italia."
  },
  {
    "user": "The word anchorman was credited by Sig Michelson about which CBS News Legend?",
    "response": "The word \"anchorman\" was credited by Sig Michelson in reference to CBS News legend Walter Cronkite.",
    "response_spanish": "La palabra \"ancla\" fue atribuida a Sig Michelson en referencia a la leyenda de CBS News Walter Cronkite."
  },
  {
    "user": "Who wrote The Picture Of Dorian Gray?",
    "response": "The Picture of Dorian Gray was written by Oscar Wilde.",
    "response_spanish": "El retrato de Dorian Gray fue escrito por Oscar Wilde."
  },
  {
    "user": "Who sang the title song for the Bond film You Only Live Twice?",
    "response": "Nancy Sinatra sang the title song for the Bond film \"You Only Live Twice.\"",
    "response_spanish": "Nancy Sinatra cantó la canción principal de la película de Bond \"Solo se vive dos veces.\""
  },
  {
    "user": "Who had a big 90s No 1 with This Is How We Do It?",
    "response": "Montell Jordan had a big 90s No. 1 with \"This Is How We Do It.\"",
    "response_spanish": "Montell Jordan tuvo un gran número 1 en los 90 con \"This Is How We Do It.\""
  },
  {
    "user": "Which national park, famous for aboriginal rock paintings, is near Darwin?",
    "response": "Kakadu National Park is near Darwin and is famous for its Aboriginal rock paintings.",
    "response_spanish": "El Parque Nacional Kakadu está cerca de Darwin y es famoso por sus pinturas rupestres aborígenes."
  },
  {
    "user": "In TV's All In The Family what was Mike and Gloria's son called?",
    "response": "Mike and Gloria's son was named Joey.",
    "response_spanish": "El hijo de Mike y Gloria se llamaba Joey."
  },
  {
    "user": "Who sang with Crosby, Stills and Young?",
    "response": "David Crosby, Stephen Stills, and Neil Young often collaborated with Graham Nash as part of the group Crosby, Stills, Nash & Young.",
    "response_spanish": "David Crosby, Stephen Stills y Neil Young a menudo colaboraron con Graham Nash como parte del grupo Crosby, Stills, Nash & Young."
  },
  {
    "user": "In which John Logie Baird invent television?",
    "response": "John Logie Baird invented the television in the early 1920s, with his first successful public demonstration occurring on March 25, 1925.",
    "response_spanish": "John Logie Baird inventó la televisión a principios de la década de 1920, con su primera demostración pública exitosa ocurriendo el 25 de marzo de 1925."
  },
  {
    "user": "Who sang the title song for the Bond film License To Kill?",
    "response": "Gladys Knight sang the title song for the Bond film \"License to Kill.\"",
    "response_spanish": "Gladys Knight cantó la canción principal de la película de Bond \"Licencia para matar.\""
  },
  {
    "user": "Black or White came from which Michael Jackson album?",
    "response": "\"Black or White\" came from Michael Jackson's album \"Dangerous.\"",
    "response_spanish": "\"Black or White\" proviene del álbum \"Dangerous\" de Michael Jackson."
  },
  {
    "user": "On a computer keyboard, which letter is between G ad J?",
    "response": "The letter H is between G and J on a computer keyboard.",
    "response_spanish": "La letra H está entre G y J en un teclado de computadora."
  },
  {
    "user": "In which town or city was General Motors founded?",
    "response": "General Motors was founded in Flint, Michigan.",
    "response_spanish": "General Motors fue fundada en Flint, Michigan."
  },
  {
    "user": "In which country was the Russian Revolutionary Leon Trotsky murdered?",
    "response": "Leon Trotsky was murdered in Mexico.",
    "response_spanish": "León Trotsky fue asesinado en México."
  },
  {
    "user": "Which duo had a 60s No 1 with A World Without Love?",
    "response": "The duo that had a 60s No 1 with \"A World Without Love\" is Peter and Gordon.",
    "response_spanish": "El dúo que tuvo un número 1 en los años 60 con \"A World Without Love\" es Peter y Gordon."
  },
  {
    "user": "In which US state was Tennessee Williams born?",
    "response": "Tennessee Williams was born in Mississippi.",
    "response_spanish": "Tennessee Williams nació en Mississippi."
  },
  {
    "user": "Who was Israeli Prime Minister from 1969 to 1974?",
    "response": "Golda Meir served as the Israeli Prime Minister from 1969 to 1974.",
    "response_spanish": "Golda Meir fue Primer Ministro de Israel desde 1969 hasta 1974."
  },
  {
    "user": "Bob Gaudio and Nick Massi sang with which group?",
    "response": "Bob Gaudio and Nick Massi were members of the group The Four Seasons.",
    "response_spanish": "Bob Gaudio y Nick Massi fueron miembros del grupo The Four Seasons."
  },
  {
    "user": "In which country was Angelica Huston born?",
    "response": "Angelica Huston was born in the United States.",
    "response_spanish": "Angelica Huston nació en los Estados Unidos."
  },
  {
    "user": "What were the first two names of 'Cannonball' Adderley?",
    "response": "The first two names of 'Cannonball' Adderley were Julian Edwin.",
    "response_spanish": "Los primeros dos nombres de 'Cannonball' Adderley eran Julian Edwin."
  },
  {
    "user": "Carrasco international airport is in which country?",
    "response": "Carrasco International Airport is located in Uruguay.",
    "response_spanish": "El Aeropuerto Internacional Carrasco está ubicado en Uruguay."
  },
  {
    "user": "Which record company signed Fabian?",
    "response": "Fabian was signed by Chancellor Records.",
    "response_spanish": "Fabian fue fichado por Chancellor Records."
  },
  {
    "user": "Ron Bower and John Williams set a speed record for going round the world in a what?",
    "response": "Ron Bower and John Williams set a speed record for going round the world in a hot air balloon.",
    "response_spanish": "Ron Bower y John Williams establecieron un récord de velocidad al dar la vuelta al mundo en un globo aerostático."
  },
  {
    "user": "What was the profession of New Yorker Garry Winogrand?",
    "response": "Garry Winogrand was a photographer.",
    "response_spanish": "Garry Winogrand era un fotógrafo."
  },
  {
    "user": "Amelia Earhart was born in which state?",
    "response": "Amelia Earhart was born in Kansas.",
    "response_spanish": "Amelia Earhart nació en Kansas."
  },
  {
    "user": "Who was Theodore Roosevelt's Vice President between 1901 and 1905?",
    "response": "Theodore Roosevelt's Vice President between 1901 and 1905 was Charles W. Fairbanks.",
    "response_spanish": "El vicepresidente de Theodore Roosevelt entre 1901 y 1905 fue Charles W. Fairbanks."
  },
  {
    "user": "What was Phil Collins' last UK No 1 of the 80s?",
    "response": "Phil Collins' last UK No. 1 of the 80s was \"Another Day in Paradise,\" which topped the charts in 1989.",
    "response_spanish": "El último número uno de Phil Collins en el Reino Unido de los 80 fue \"Another Day in Paradise,\" que alcanzó la cima de las listas en 1989."
  },
  {
    "user": "What was Al Pacino's first movie?",
    "response": "Al Pacino's first movie was \"Me, Natalie,\" released in 1969.",
    "response_spanish": "La primera película de Al Pacino fue \"Yo, Natalie,\" estrenada en 1969."
  },
  {
    "user": "In which year did Alcock and Brown make their Atlantic crossing?",
    "response": "Alcock and Brown made their Atlantic crossing in 1919.",
    "response_spanish": "Alcock y Brown realizaron su cruce del Atlántico en 1919."
  }
]